{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"A":37,"B":38,"C":39,"D":40,"E":41,"F":42,"G":43,"H":44,"I":45,"J":46,"K":47,"L":48,"M":49,"N":50,"O":51,"P":52,"Q":53,"R":54,"S":55,"T":56,"U":57,"V":58,"W":59,"X":60,"Y":61,"Z":62,"[":63,"\\":64,"]":65,"^":66,"_":67,"`":68,"a":69,"b":70,"c":71,"d":72,"e":73,"f":74,"g":75,"h":76,"i":77,"j":78,"k":79,"l":80,"m":81,"n":82,"o":83,"p":84,"q":85,"r":86,"s":87,"t":88,"u":89,"v":90,"w":91,"x":92,"y":93,"z":94,"{":95,"|":96,"}":97,"~":98,"¡":99,"¢":100,"£":101,"¤":102,"¥":103,"¦":104,"§":105,"¨":106,"©":107,"ª":108,"«":109,"¬":110,"®":111,"¯":112,"°":113,"±":114,"²":115,"³":116,"´":117,"µ":118,"¶":119,"·":120,"¸":121,"¹":122,"º":123,"»":124,"¼":125,"½":126,"¾":127,"¿":128,"À":129,"Á":130,"Â":131,"Ã":132,"Ä":133,"Å":134,"Æ":135,"Ç":136,"È":137,"É":138,"Ê":139,"Ë":140,"Ì":141,"Í":142,"Î":143,"Ï":144,"Ð":145,"Ñ":146,"Ò":147,"Ó":148,"Ô":149,"Õ":150,"Ö":151,"×":152,"Ø":153,"Ù":154,"Ú":155,"Û":156,"Ü":157,"Ý":158,"Þ":159,"ß":160,"à":161,"á":162,"â":163,"ã":164,"ä":165,"å":166,"æ":167,"ç":168,"è":169,"é":170,"ê":171,"ë":172,"ì":173,"í":174,"î":175,"ï":176,"ð":177,"ñ":178,"ò":179,"ó":180,"ô":181,"õ":182,"ö":183,"÷":184,"ø":185,"ù":186,"ú":187,"û":188,"ü":189,"ý":190,"þ":191,"ÿ":192,"Ā":193,"ā":194,"Ă":195,"ă":196,"Ą":197,"ą":198,"Ć":199,"ć":200,"Ĉ":201,"ĉ":202,"Ċ":203,"ċ":204,"Č":205,"č":206,"Ď":207,"ď":208,"Đ":209,"đ":210,"Ē":211,"ē":212,"Ĕ":213,"ĕ":214,"Ė":215,"ė":216,"Ę":217,"ę":218,"Ě":219,"ě":220,"Ĝ":221,"ĝ":222,"Ğ":223,"ğ":224,"Ġ":225,"ġ":226,"Ģ":227,"ģ":228,"Ĥ":229,"ĥ":230,"Ħ":231,"ħ":232,"Ĩ":233,"ĩ":234,"Ī":235,"ī":236,"Ĭ":237,"ĭ":238,"Į":239,"į":240,"İ":241,"ı":242,"Ĳ":243,"ĳ":244,"Ĵ":245,"ĵ":246,"Ķ":247,"ķ":248,"ĸ":249,"Ĺ":250,"ĺ":251,"Ļ":252,"ļ":253,"Ľ":254,"ľ":255,"Ŀ":256,"ŀ":257,"Ł":258,"ł":259,"Ń":260,"ĠĠ":261,"čĊ":262,"ĠĠĠĠ":263,"in":264,"ĠĠĠ":265,"int":266,"de":267,"ĉĉ":268,"ĠĠĠĠĠĠĠĠ":269,"Ġ=":270,"st":271,"Ġi":272,"Ġ<":273,");":274,"re":275,"def":276,"or":277,"ĠĠĠĠĠĠĠ":278,"Ġ(":279,"on":280,"ine":281,"Ġc":282,"define":283,"Ġl":284,"Ġa":285,"Ġ{":286,"Ġm":287,"se":288,"Ġf":289,"Ġn":290,"Ġp":291,"++":292,"Ġ1":293,"00":294,"cl":295,"Ġ0":296,"Ġ}":297,"ou":298,"ur":299,"en":300,"Ġs":301,"Ġint":302,"()":303,"clu":304,"inclu":305,"include":306,"ret":307,"ll":308,"**":309,"Ġv":310,"Ġ<<":311,"urn":312,"return":313,"std":314,"--":315,"ĠĠĠĠĠĠĠĠĠĠĠ":316,"Ġ+":317,"Ġ>":318,"ong":319,"//":320,"..":321,"out":322,"it":323,"Ġt":324,"Ġb":325,"Ġfor":326,"Ġif":327,"Ġ-":328,"ac":329,"Ġ\"":330,"am":331,"Ġlong":332,"<<":333,"];":334,"at":335,"][":336,"Ġd":337,"er":338,"ing":339,"con":340,"ns":341,"yp":342,"ir":343,"Ġx":344,"us":345,"Ġreturn":346,"if":347,"le":348,"++)":349,"ĉĉĉ":350,"ct":351,"Ġ&":352,"end":353,"\",":354,"typ":355,"Ġma":356,"(\"":357,"Ġ*":358,"al":359,"id":360,"KK":361,"ame":362,"ect":363,"ar":364,"){":365,"ector":366,"mp":367,"****":368,"iz":369,"__":370,"ize":371,"Ġll":372,"Ġ>>":373,"type":374,"Ġstd":375,"::":376,"Ġj":377,"Ġr":378,"0000":379,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":380,"].":381,"op":382,"==":383,"str":384,"ĠT":385,"const":386,"ue":387,"os":388,"ma":389,"Ġcout":390,"Ġ==":391,"Ġe":392,"typedef":393,"air":394,"an":395,"for":396,"WW":397,"();":398,"nt":399,"ol":400,"EE":401,"Ġans":402,"Ġcin":403,"Ġre":404,"size":405,"using":406,"hi":407,"ace":408,"ack":409,"ti":410,"Ġ'":411,"sp":412,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":413,"lse":414,">>":415,"Ġy":416,"Ġname":417,"od":418,"ut":419,"Ġ2":420,"io":421,"emp":422,"space":423,"##":424,"----":425,"ate":426,"string":427,"Ġu":428,"eg":429,"Ġnamespace":430,"],":431,"))":432,"(\"%":433,"oid":434,"Ġk":435,"back":436,"endl":437,"ush":438,"Ġw":439,"Ġ;":440,"um":441,"....":442,"ĠĠĠĠĠ":443,"Ġg":444,"set":445,"ĠM":446,"Ġmain":447,"ĉĉĉĉ":448,"as":449,"âĸ":450,"])":451,"egin":452,"Ġvector":453,"Ġ%":454,"irst":455,"hile":456,"begin":457,"bit":458,"Ġ<=":459,"ans":460,"LL":461,"ble":462,"Ġin":463,"ow":464,"cout":465,"vector":466,"Ġ,":467,"stre":468,"can":469,"empl":470,"stream":471,"Ġ++":472,"cond":473,"!=":474,"********":475,"second":476,"ith":477,"Ġpr":478,"emplate":479,"ch":480,"DD":481,"ii":482,"ouble":483,"Ġpair":484,"cin":485,"]=":486,"xt":487,"bits":488,"<<\"":489,"stdio":490,"++.":491,"Ġ+=":492,"stdc":493,"pr":494,"canf":495,"Ġ//":496,"]);":497,"Ġelse":498,"Ġ)":499,"Ġ&&":500,"ase":501,"Ġcon":502,"tie":503,"KKKK":504,"<=":505,"void":506,"template":507,"ed":508,"),":509,"(),":510,"ve":511,"\";":512,"ig":513,"++;":514,"ool":515,"pair":516,"Ġ:":517,"ĠF":518,"intf":519,"88":520,"ĠN":521,"ename":522,"ass":523,"et":524,"Ġendl":525,"Ġres":526,"nc":527,"Ġ|":528,"));":529,"Ġ/":530,"Ġwhile":531,"is":532,"Ġq":533,"Ġmod":534,"alse":535,"push":536,"ĠčĊ":537,"IN":538,"¿½":539,"ï¿½":540,"ator":541,"ĠA":542,"Ġdouble":543,"ync":544,"im":545,"with":546,"line":547,"erator":548,"ad":549,"Ġ!=":550,"Ġmax":551,"sync":552,"open":553,"Ġscanf":554,").":555,"ĠS":556,"Ġo":557,"10":558,"ode":559,"reopen":560,"--------":561,"max":562,"ke":563,"ĠP":564,"first":565,"rt":566,"nd":567,"put":568,"EEEE":569,"Ġconst":570,"else":571,"...":572,"â£":573,"////":574,"pb":575,"ree":576,"WWWW":577,"Ġar":578,"Ġop":579,"++){":580,"ï¿½ï¿½":581,"Ġch":582,"Ġtr":583,"Ġfirst":584,"####":585,"uto":586,"MM":587,";}":588,"Ġdp":589,"Ġ__":590,"Ġit":591,"base":592,"())":593,"long":594,"ag":595,"OD":596,"=(":597,"Ġ_":598,"Ġpush":599,"Ġmin":600,"Ġ>=":601,"Ġ3":602,"Ġh":603,"AX":604,"ĠR":605,"typename":606,"ot":607,"Ġcnt":608,"ic":609,"que":610,"ul":611,"Ġprintf":612,"........":613,"bool":614,"char":615,"Ġst":616,"em":617,"cnt":618,"Ġ#":619,"class":620,"};":621,"ist":622,"dp":623,"Ġsecond":624,"of":625,"____":626,"un":627,"((":628,"Ġios":629,"00000000":630,"map":631,";;":632,"Ġval":633,"while":634,"Ġpb":635,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":636,"';":637,"es":638,"sert":639,"tin":640,"Ġmake":641,"ast":642,"mod":643,"ort":644,"txt":645,"ĠL":646,"64":647,"Ġvoid":648,"auto":649,"Ġmp":650,"****************":651,"om":652,"err":653,"false":654,",,":655,"ion":656,"+=":657,"ign":658,"--)":659,"fs":660,"â£¿":661,"')":662,"olve":663,"ck":664,"(){":665,"GG":666,"âĸĳ":667,"Ġ\"<<":668,"inline":669,"cur":670,"Ġsz":671,"bu":672,"ak":673,"ĠMOD":674,"min":675,"res":676,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":677,"Ġ((":678,"Ġ||":679,"ĠD":680,"val":681,"tr":682,"000":683,"ĠC":684,"====":685,"Ġget":686,">=":687,"Ġde":688,"ĠĠĠĠĠĠ":689,"ĠG":690,"DDDD":691,"\",&":692,"pp":693,"il":694,"Ġsum":695,"());":696,"Ġtyp":697,"Ġall":698,"Ġoperator":699,"\");":700,"Ġcur":701,"orde":702,"ap":703,"pos":704,"INF":705,"ge":706,"OR":707,"11":708,"]==":709,"cd":710,"ind":711,"ount":712,"--;":713,"node":714,",-":715,"Ġstring":716,"igned":717,"ĠI":718,"Ġld":719,"endif":720,"ext":721,"\")":722,"ĠĠĠĠĠĠĠĠĠ":723,"tinue":724,"Ġtrue":725,"ath":726,"arr":727,"reak":728,"iostream":729,"queue":730,"lld":731,"lo":732,"ime":733,"8888":734,"Ġpii":735,"Ġfreopen":736,"ĠB":737,"Ġsize":738,"->":739,"MAX":740,"]]":741,"sum":742,"Ġmid":743,"he":744,"Ġmem":745,"Ġto":746,"freopen":747,"Ġad":748,"Ġz":749,"âĸĳâĸĳ":750,"tim":751,"EP":752,"ithm":753,"â£¿â£¿":754,"gor":755,"ĉĉĉĉĉ":756,"pd":757,"gorithm":758,"Ġbool":759,"Ġ\";":760,"âĸĪ":761,"Ġ?":762,"99":763,"ds":764,"Ġfalse":765,"algorithm":766,"Ġsolve":767,"Ġarr":768,"ĉčĊ":769,"scanf":770,"tree":771,"Ġse":772,"ver":773,"Ġ'\\":774,"len":775,"all":776,"printf":777,"gs":778,"nsigned":779,"cm":780,"]-":781,"num":782,"double":783,"Ġrep":784,"bs":785,"ĠINF":786,"ent":787,"ix":788,"Ġ100000000":789,"ower":790,"agma":791,"pragma":792,"KKKKKKKK":793,"////////":794,"ES":795,"pop":796,"get":797,"th":798,"Ġtypename":799,"NO":800,"Ġout":801,"&&":802,"Ġstdin":803,"pre":804,"est":805,"Ġret":806,"Ġ10":807,"Ġsort":808,"AR":809,"Ġ5":810,"Ġcl":811,"sz":812,"*(":813,"ĠLL":814,"ostream":815,"Ġchar":816,"Ġis":817,"red":818,"ff":819,"Ġdfs":820,"Ġunsigned":821,"Ġ7":822,"to":823,"++--":824,"]+":825,"Ġpos":826,"Ġinf":827,"Ġvi":828,"ĠFOR":829,"(!":830,"----------------":831,"ub":832,"ĠĠĠĠĠĠĠĠĠĠĠĠ":833,"Ġ-=":834,"omp":835,"Ġ(!":836,"fr":837,")%":838,"++--++--":839,"ld":840,"ay":841,"ĠV":842,"Ġcontinue":843,"ound":844,"Ġset":845,"ULL":846,"Ġ\\":847,"mx":848,"Ġcerr":849,"Ġinline":850,"ios":851,"oint":852,"MMMM":853,"ĠĠĠĠĠĠĠĠĠĠ":854,"Ġ);":855,"/*":856,"count":857,"ft":858,"ĠGC":859,"Ġmemset":860,"ull":861,"input":862,"32":863,"Ġtree":864,"\",\"":865,"Ġos":866,"Ġbreak":867,"Ġid":868,"ex":869,")(":870,"ifdef":871,"ht":872,"pdate":873,"########":874,");}":875,"sk":876,"ĠGCC":877,"ps":878,"Ġgcd":879,"ĠO":880,"ss":881,"',":882,"insert":883,"Ġ4":884,"ordered":885,"ĠĠĠĠčĊ":886,"Ġ--":887,"âĸĪâĸĪ":888,"Ġmx":889,"cmath":890,"Ġ\"\\":891,"ĠMAX":892,"âĸĴ":893,"53":894,"vi":895,"Ġpre":896,"ï¿½ï¿½ï¿½ï¿½":897,"ta":898,"li":899,"Ġfi":900,"Ġstr":901,"18":902,"*/":903,")/":904,"ight":905,"\"<<":906,"mid":907,"15":908,"GS":909,"idx":910,"cstdio":911,"Ġ1000000007":912,"100":913,"Ġfr":914,"and":915,"Ġ\",":916,"stack":917,"Ġclass":918,",&":919,"Ġnum":920,"ro":921,"Ġstdout":922,"bug":923,"Ġlen":924,"26":925,"art":926,"pii":927,"NULL":928,"fi":929,"now":930,"YES":931,"________":932,"uct":933,"Ġadd":934,"ĠĠĠĠĠĠĠĠĠĠĠĠĠ":935,"sizeof":936,"10000":937,"ip":938,"Ġread":939,"................":940,"ĠPI":941,"ce":942,"ax":943,"bound":944,"EEEEEEEE":945,"[]":946,"ĠU":947,"ost":948,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":949,"sed":950,"========":951,"ty":952,"Ġ]":953,"(-":954,"//#":955,"fl":956,"Ġpll":957,">&":958,"'.":959,"ity":960,"ĠAr":961,"hpp":962,"14":963,"...)":964,"output":965,"12":966,"@@":967,"ĠĊ":968,"vis":969,"ARGS":970,"oc":971,"]++;":972,"uer":973,"Ġpi":974,"Ġoptim":975,"ment":976,"eck":977,"MAXN":978,"ĠĠĠĠĉ":979,"sse":980,"SE":981,"ite":982,";;;;":983,"ĠX":984,"are":985,"Ġ.":986,"({":987,"VA":988,"cstring":989,"his":990,"ĠE":991,"order":992,"Ġull":993,"Ġtmp":994,"uery":995,"Ġ!":996,"ĠREP":997,"âĸĴâĸĴ":998,"OC":999,"Ġoptimize":1000,";++":1001,"ec":1002,"Ġtemplate":1003,"iterator":1004,"wap":1005,"Ġmap":1006,"********************************":1007,"act":1008,"Ġac":1009,"20":1010,",,,,":1011,"erase":1012,"Ġsq":1013,"Ġmul":1014,"ction":1015,"Ġ[":1016,"Ġne":1017,"Ġle":1018,"Ġss":1019,"().":1020,"stdin":1021,"Ġ10000":1022,"verse":1023,">(":1024,"});":1025,"Ġsizeof":1026,"::::":1027,"Ġput":1028,"]){":1029,"abs":1030,"');":1031,"Ġii":1032,"Ġ*/":1033,"Ġdebug":1034,"up":1035,"INE":1036,"assert":1037,"WWWWWWWW":1038,"MOD":1039,"struct":1040,"33":1041,"tmp":1042,"lib":1043,">,":1044,"ont":1045,"97":1046,"buil":1047,"Ġvalue":1048,"sort":1049,"empty":1050,"cerr":1051,"rep":1052,"Ġnode":1053,"LINE":1054,"ep":1055,"gn":1056,"man":1057,"Ġbu":1058,"GGGG":1059,"Ġtemp":1060,"unordered":1061,"Ġvis":1062,"Ġeps":1063,"Ġthe":1064,"stdlib":1065,"///":1066,"Ġauto":1067,"stat":1068,"Ġof":1069,"cle":1070,"maxn":1071,"DG":1072,"]=='":1073,"update":1074,"ata":1075,"âķ":1076,"prec":1077,"az":1078,"time":1079,"DDDDDDDD":1080,"ision":1081,"front":1082,"','.":1083,"Ġand":1084,"Ġ*=":1085,"atr":1086,"1000":1087,"Ġex":1088,"Ġsc":1089,"ok":1090,"clo":1091,"<<'":1092,"Ġ%=":1093,"bitset":1094,"Ġlo":1095,")-":1096,"Ġarg":1097,"<<(":1098,"precision":1099,"Ġdist":1100,"24":1101,")+":1102,"WWW":1103,"find":1104,"Ġend":1105,"Int":1106,"ult":1107,"Ġmn":1108,"////////////////":1109,"gcd":1110,"ioman":1111,"iomanip":1112,"88888888":1113,"]={":1114,"Ġ(\"":1115,"Ġ^":1116,"(...)":1117,"mem":1118,">;":1119,"âĸĢ":1120,"âł":1121,"ore":1122,"Ġadj":1123,"mn":1124,"Ġabs":1125,"(__":1126,"++--++--++--++--":1127,"58":1128,"ĠĠčĊ":1129,"Ġacos":1130,"Ġ1000":1131,"gth":1132,"stdout":1133,"â£¿â£¿â£¿â£¿":1134,"Ġok":1135,"(_":1136,"ab":1137,"Ġ\"<<#":1138,"unction":1139,"resize":1140,"Ġinclude":1141,"Ġdb":1142,"EEE":1143,"JU":1144,"one":1145,")*":1146,"ER":1147,"break":1148,"<<\"\\":1149,"Ġlast":1150,"atrix":1151,"AL":1152,"Ġfast":1153,"DGE":1154,"top":1155,"JUDGE":1156,"NLINE":1157,"Ġvec":1158,"<(":1159,"vec":1160,"pper":1161,"builtin":1162,"Ġbase":1163,"Ġ6":1164,"ange":1165,"EB":1166,"dist":1167,"ĠH":1168,"159":1169,"its":1170,"Ġ';":1171,"cstdlib":1172,"temp":1173,"Ġdefine":1174,"list":1175,"continue":1176,"Ġostream":1177,"rand":1178,")*(":1179,"arent":1180,"14159":1181,"Ġcom":1182,"mask":1183,"comp":1184,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":1185,"dfs":1186,"ptr":1187,"clock":1188,"1415926":1189,")<<":1190,"Ġ/=":1191,"rite":1192,"--){":1193,"||":1194,"dex":1195,"this":1196,"xx":1197,"lock":1198,"ndef":1199,"ead":1200,"KKK":1201,"Ġtype":1202,"rr":1203,"In":1204,"name":1205,"Ġfl":1206,"Ġas":1207,"par":1208,"ie":1209,"â¢":1210,"','.','.":1211,"Ġth":1212,"gnu":1213,"Max":1214,"add":1215,"ash":1216,"43":1217,"ess":1218,"Ġcheck":1219,"Ġgo":1220,"args":1221,"ĠONLINE":1222,"âĸĦ":1223,"ST":1224,"à¦":1225,"ifndef":1226,"âĸĳâĸĳâĸĳâĸĳ":1227,"rbegin":1228,"Ġpar":1229,"tag":1230,"Ġidx":1231,"deque":1232,"iner":1233,"true":1234,"]!=":1235,"Ġswap":1236,"Ġtot":1237,"tainer":1238,"22":1239,"Ġhi":1240,"clear":1241,"141592653":1242,"Ġdx":1243,"EPS":1244,"ĠMAXN":1245,">::":1246,"('":1247,"si":1248,"Ġcomp":1249,"Ġvv":1250,"37":1251,"ne":1252,"ixed":1253,"solve":1254,"ior":1255,"Ġdy":1256,"sstream":1257,"MMMMMMMM":1258,"},":1259,"Ġfind":1260,"30":1261,"Ġff":1262,"50":1263,"ĉĉĉĉĉĉ":1264,"Ġquery":1265,"]*":1266,"col":1267,"ctime":1268,"Ġdi":1269,"azy":1270,"lex":1271,"iority":1272,"pl":1273,"Ġputs":1274,"Ġsh":1275,"OCAL":1276,"SEC":1277,"Ġed":1278,"length":1279,"Ġnow":1280,"UG":1281,"ĠY":1282,"Ġun":1283,"di":1284,"Ġbit":1285,"Ġ){":1286,"<<\":":1287,"ĠK":1288,"pbds":1289,"-=":1290,"55":1291,"cc":1292,"istream":1293,"################":1294,"function":1295,"(),(":1296,"AC":1297,"container":1298,"/=":1299,"fast":1300,"ink":1301,"00005":1302,"pow":1303,"tt":1304,"Ġprint":1305,"Ġ};":1306,"ics":1307,"null":1308,"alc":1309,"adj":1310,"last":1311,"aa":1312,"Ġen":1313,"Ġ100":1314,"uti":1315,"chr":1316,"ĠLOCAL":1317,"pll":1318,"istics":1319,"LE":1320,"EBUG":1321,"ber":1322,"IO":1323,"ation":1324,"Ġupdate":1325,"hs":1326,"arget":1327,"statistics":1328,"Ġ++)":1329,"assoc":1330,"ng":1331,"pol":1332,"ĠIn":1333,"av":1334,"cassert":1335,"Ġĉ":1336,"ĠEPS":1337,"Ġ9":1338,"make":1339,"Ġnext":1340,"operator":1341,"dd":1342,":.":1343,"...);":1344,"â¡":1345,"ĠArgs":1346,"left":1347,"Ġcount":1348,"<<\"=":1349,"]-'":1350,"16":1351,"KKKKK":1352,"__)":1353,"row":1354,"Ġargs":1355,"38":1356,"Ġstart":1357,"el":1358,"Ġ{}":1359,"sub":1360,"Ġcol":1361,"gh":1362,"popcount":1363,"ono":1364,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":1365,"root":1366,"Ġï¿½ï¿½ï¿½ï¿½":1367,"<<#":1368,"998":1369,"Ġmaxn":1370,"ĠArg":1371,"Ġvll":1372,"value":1373,"=-":1374,"Ġnxt":1375,"Ġtarget":1376,"14159265358":1377,"Ġpoint":1378,"Ġ\":":1379,"ĉĉčĊ":1380,"rend":1381,"polic":1382,"=='":1383,"Ġlower":1384,"46":1385,"inf":1386,"It":1387,"pt":1388,"oot":1389,"<<\"=\"<<":1390,"Ġpower":1391,"ive":1392,"ĉĊ":1393,"Ġseg":1394,"Ġgetchar":1395,"Ġbe":1396,"Ġleft":1397,"ĉĠĠĠ":1398,"Ġ()":1399,"lli":1400,"Ġright":1401,"ha":1402,"]+=":1403,"read":1404,"lim":1405,"Ġinit":1406,"eric":1407,"]));":1408,"mt":1409,"Ġsqr":1410,"used":1411,"ĠW":1412,"1415926535897":1413,"Ġnew":1414,"99824":1415,"Ġparent":1416,"31":1417,"56":1418,"functional":1419,"Ġgr":1420,"lic":1421,"FOR":1422,"ild":1423,"ME":1424,"Size":1425,"================":1426,"9982443":1427,"Ġscan":1428,"14159265358979":1429,"998244353":1430,"ype":1431,"ary":1432,"()-":1433,"Ġforn":1434,"ĠQ":1435,")))":1436,"policy":1437,"tot":1438,"wer":1439,"Ġhe":1440,"iff":1441,"1111":1442,"34":1443,"Ġnull":1444,"Ġless":1445,"Ġpow":1446,"@@@@":1447,"]];":1448,"<<\"=\"<<(":1449,"expr":1450,"Ġind":1451,"Ġreverse":1452,"Ġ...":1453,"mul":1454,"Ġvii":1455,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":1456,"typeof":1457,"Ġ->":1458,"seg":1459,"ges":1460,"Ġrb":1461,"ĠSZ":1462,"hild":1463,"lf":1464,"]].":1465,"Ġusing":1466,"RE":1467,"ero":1468,"Ġused":1469,"Ġsp":1470,"--------------------------------":1471,"UT":1472,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":1473,"Ġfact":1474,"Ġresult":1475,"Ġyou":1476,"ublic":1477,"next":1478,"inv":1479,"INT":1480,"ique":1481,"chrono":1482,"[]={":1483,"Ġ>>=":1484,"Ġpf":1485,"ĠIO":1486,"Ġfrom":1487,"ĠĠĠĠĉĉ":1488,"nxt":1489,"Ġpop":1490,"numeric":1491,"Ġbuild":1492,"Ġmy":1493,"-'":1494,"low":1495,"Ġroot":1496,"sc":1497,"(\"-":1498,"Ġassert":1499,"com":1500,"]>":1501,"ĠĠĠĠĊ":1502,"77":1503,"KKKKKKKKKKKKKKKK":1504,"Ġ/*":1505,"right":1506,"199":1507,"point":1508,"qu":1509,"fstream":1510,"Ġtest":1511,"RT":1512,"go":1513,"Ġpriority":1514,"Ġor":1515,"âĸĪâĸĪâĸĪâĸĪ":1516,"]<<\"":1517,"start":1518,"1415926535897932":1519,"Ġinv":1520,"ater":1521,"+(":1522,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":1523,"flag":1524,"FF":1525,",;":1526,"]--;":1527,"II":1528,"]))":1529,"link":1530,"check":1531,"Ġfixed":1532,"ob":1533,"Ġ::":1534,"Ġsub":1535,"imes":1536,"Ġsol":1537,"Ġmask":1538,"ove":1539,"lace":1540,"aph":1541,"Ġon":1542,"Matrix":1543,"nullptr":1544,"orm":1545,"uple":1546,"no":1547,"sq":1548,"lement":1549,"%=":1550,"pi":1551,"Ġtrace":1552,"fact":1553,"ular":1554,"reater":1555,"main":1556,"data":1557,"math":1558,"01":1559,"(*":1560,"ĠMod":1561,"edge":1562,"Ġupper":1563,")){":1564,"bb":1565,"Ġsqrt":1566,"test":1567,"ah":1568,"Ġrem":1569,"dis":1570,"141592653589793238":1571,"]<":1572,"Ġlcm":1573,"200":1574,"PER":1575,"ail":1576,"ros":1577,"Ġdep":1578,"uff":1579,"MP":1580,"Ġemp":1581,"signed":1582,"Ġdo":1583,"+=(":1584,"Ġat":1585,"prime":1586,",(":1587,"Mod":1588,"Ġcan":1589,"Ġflag":1590,"Node":1591,"19937":1592,"RO":1593,"Ġvvi":1594,",+":1595,"REP":1596,"-(":1597,"(\"\\":1598,"puts":1599,"Ġwrite":1600,"Ġdis":1601,"Ġ998244353":1602,"Ġcost":1603,"OCK":1604,"memset":1605,"LOCK":1606,"Ġlow":1607,"Ġmd":1608,"()){":1609,"*=":1610,"gr":1611,"14159265358979323846":1612,"IT":1613,"Ġpref":1614,"Ġpq":1615,"]][":1616,"Ġtypedef":1617,"Ġ31":1618,"dig":1619,"Ġsetprecision":1620,"No":1621,"________________":1622,"ĠDEBUG":1623,"Ġ8":1624,"âĸĴâĸĴâĸĴâĸĴ":1625,"unique":1626,"able":1627,"atch":1628,"dge":1629,"'){":1630,"ILE":1631,"Ġms":1632,"ĉĠ":1633,"swap":1634,"100005":1635,"++--++--++--++--++--++--++--++--":1636,"Ġclock":1637,"Ġprime":1638,"per":1639,"âĸĢâĸĢ":1640,"Ġ20":1641,"LOCKS":1642,"ON":1643,"exp":1644,"yy":1645,"[(":1646,"getchar":1647,"ĠĠĠĠĠĠĠĠčĊ":1648,"Ġpa":1649,"79":1650,"uint":1651,"48":1652,"Ġordered":1653,"MX":1654,"pa":1655,"public":1656,"ark":1657,"00000":1658,"iii":1659,"Ġuint":1660,"vv":1661,"ĠALL":1662,"oo":1663,"Ġvs":1664,"sin":1665,"rem":1666,"ill":1667,"~~":1668,"]=(":1669,"loop":1670,"query":1671,"Ġxx":1672,"Ġpt":1673,"ĠĠĠčĊ":1674,"Ġup":1675,"******":1676,"Point":1677,"]]++;":1678,"&(":1679,"Ġbegin":1680,"19":1681,"100000000":1682,"eger":1683,"Ġque":1684,"Ġmulti":1685,"ited":1686,"Ġ'<<":1687,"be":1688,"tion":1689,"Ġcomment":1690,"Val":1691,"Ġerr":1692,"Ġ),":1693,"500":1694,"avx":1695,"odd":1696,"cost":1697,"lity":1698,"17":1699,"DE":1700,"WK":1701,",_":1702,"hash":1703,"har":1704,"jj":1705,"ative":1706,")<<\",":1707,"from":1708,"index":1709,")));":1710,"vl":1711,"ly":1712,"och":1713,"Ġpw":1714,"ory":1715,"Ofast":1716,"linker":1717,"ave":1718,"complex":1719,"ven":1720,");++":1721,"Ġver":1722,"dep":1723,"ang":1724,"):":1725,"epoch":1726,"since":1727,"Ġ(((":1728,"curr":1729,"Ġexit":1730,"random":1731,"Ġ\"/":1732,"]),":1733,"23":1734,"req":1735,"////////////////////////////////":1736,"-')":1737,"GGGGGGGG":1738,"wo":1739,"Ġbin":1740,"/**":1741,"sh":1742,"write":1743,"ach":1744,"su":1745,"Ġpp":1746,"Ġdbg":1747,"Ġiter":1748,"arg":1749,"Ġthis":1750,"Ġanswer":1751,"++]":1752,"mark":1753,"Ġ100000":1754,"MatrixSize":1755,"Ġsf":1756,"Ġrall":1757,"utility":1758,"Ġcalc":1759,"100000":1760,">>(":1761,"]])":1762,"acro":1763,"our":1764,"Ġbest":1765,"ĠIOS":1766,"substr":1767,"),(":1768,"Ġ^=":1769,"59":1770,"Ġ///":1771,"28":1772,"lazy":1773,"Ġtm":1774,"stead":1775,"Ġke":1776,"own":1777,"Ġinput":1778,"Iterator":1779,"heap":1780,"MaxMatrixSize":1781,"âĸĮ":1782,"Ġneed":1783,"AS":1784,"Ġ++;":1785,"Ġstat":1786,"Ġcmp":1787,"Ġno":1788,"Ġdata":1789,"init":1790,"Pos":1791,"ca":1792,"Time":1793,"vel":1794,"array":1795,"lower":1796,"Ġprev":1797,"Ġ\")":1798,".....":1799,"27":1800,"Ġoo":1801,"ĠPoint":1802,"Ġlb":1803,"Ġrhs":1804,"stringstream":1805,"rk":1806,"Ġvl":1807,"constexpr":1808,"ĠInt":1809,"Ġ30":1810,"Ġyy":1811,"Ġlli":1812,"Ġaa":1813,"sim":1814,"60":1815,"vs":1816,"Ġ(*":1817,"te":1818,"Ġrng":1819,"Ġputchar":1820,"++,":1821,"TES":1822,"ross":1823,"AT":1824,"mat":1825,"Char":1826,"Ġ26":1827,"names":1828,"','.','.','.','.":1829,"9999":1830,"__,":1831,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":1832,"static":1833,"new":1834,"âķĲ":1835,"steady":1836,"ĠMax":1837,"buf":1838,"Ġ\"]":1839,"iv":1840,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĉ":1841,"Ġlazy":1842,"................................":1843,"co":1844,"___":1845,")==":1846,"ĠPII":1847,"29":1848,"Ġ'.":1849,"Ġwh":1850,"ms":1851,"Ġtt":1852,"memory":1853,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":1854,"------":1855,"db":1856,"Ġstatic":1857,"CRT":1858,"less":1859,"emplace":1860,"Case":1861,"Count":1862,"Ġemplace":1863,"Ġtl":1864,"URE":1865,"Ġbig":1866,"###":1867,"Ġindex":1868,"13":1869,"erge":1870,"KKKKKKK":1871,"Ġnot":1872,"ĠMP":1873,"hor":1874,"Yes":1875,"Ġistream":1876,"Ġmt":1877,"key":1878,"power":1879,"ĠDB":1880,"','":1881,"Tree":1882,"ays":1883,"ust":1884,"SECURE":1885,"tex":1886,"Ġdel":1887,"\".":1888,"ĠPB":1889,";.":1890,"ord":1891,"200005":1892,"Ġrange":1893,"Ġupd":1894,"mi":1895,"Ġfill":1896,"Ġgc":1897,"Ġcurr":1898,"Ġrev":1899,"file":1900,"pref":1901,"sol":1902,"Ġan":1903,"Ġfin":1904,"tf":1905,"Type":1906,"Ġtime":1907,"ance":1908,"element":1909,"Ġbuf":1910,"Ġedge":1911,"]]=":1912,"iiii":1913,"ice":1914,"<=(":1915,">>=":1916,"tuple":1917,"loat":1918,"loops":1919,"(;":1920,"Ġcc":1921,"Ġnorm":1922,"cr":1923,"Ġby":1924,"Ġsu":1925,"Ġli":1926,"Ġline":1927,"sqrt":1928,"################################":1929,"))%":1930,"AN":1931,"âĸĦâĸĦ":1932,"ALL":1933,"nx":1934,"Ġarray":1935,"},{":1936,"ter":1937,"Ġsi":1938,"Ġmark":1939,"%%":1940,"Ġinsert":1941,"Ġexp":1942,"Ġ\"[":1943,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":1944,"ard":1945,"iend":1946,"popcnt":1947,"rime":1948,"reverse":1949,"Ġmk":1950,"OF":1951,"âĶ":1952,"();}":1953,"calc":1954,"digit":1955,"Ġco":1956,"Ġ',":1957,"ĠMX":1958,"roll":1959,"Edge":1960,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":1961,"tl":1962,"SZ":1963,"Ġps":1964,"Out":1965,"/********************************":1966,"md":1967,"unsigned":1968,")),":1969,"cp":1970,"Ġrr":1971,"Ġ|=":1972,"1010":1973,"DDD":1974,"Ġfile":1975,"multi":1976,"mmx":1977,"ĠFI":1978,"flush":1979,"ssse":1980,";;;;;;;;":1981,"unroll":1982,"Ġ(;":1983,"ial":1984,"abm":1985,"IZ":1986,"ift":1987,"GGG":1988,"âĶĢ":1989,"Min":1990,"KE":1991,"40":1992,"pq":1993,"ank":1994,",,,,,,,,":1995,"arch":1996,"Arr":1997,"ln":1998,"mall":1999,"âķ¬":2000,"FS":2001,"high":2002,"8888888888888888":2003,"])%":2004,"DDDDDDDDDDDD":2005,"57":2006,"]%":2007,"NIN":2008,"br":2009,"best":2010,"ARNIN":2011,"Ġdepth":2012,"ET":2013,"Ġmi":2014,"Ġrand":2015,"WARNIN":2016,"ls":2017,"WARNINGS":2018,"]<<":2019,"TT":2020,"clim":2021,"Integer":2022,"Ġĉĉ":2023,"Ġpc":2024,"une":2025,"FILE":2026,"Ġthrow":2027,"Ġdiff":2028,"der":2029,"Ġnumber":2030,"Ġiterator":2031,"ution":2032,"Ġfore":2033,"Ġub":2034,"WWWWWWW":2035,"climits":2036,">=(":2037,"St":2038,")?":2039,"]>=":2040,"=\"":2041,"uthor":2042,"flow":2043,"limits":2044,"fixed":2045,"ra":2046,"OUT":2047,"setprecision":2048,"AST":2049,"\\\\":2050,"Ġrow":2051,"maxN":2052,"Ġbs":2053,"3456":2054,"MMMMMMMMMMMMMMMM":2055,"Ġone":2056,"IZE":2057,"!!":2058,"à§":2059,"Ġnames":2060,"native":2061,"Ġ');":2062,"WWWWWW":2063,"Line":2064,"diff":2065,"EEEEEEEEEEEE":2066,"Ġ.,;":2067,"**************":2068,"Ġstruct":2069,"mm":2070,"â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿":2071,"Ġedges":2072,"by":2073,"dx":2074,"prev":2075,"ĠĠĠĉ":2076,"Ġ\"\";":2077,"ĠFor":2078,"EC":2079,"â£¿â£":2080,"tune":2081,"Ġneg":2082,"Ġtotal":2083,"://":2084,"onent":2085,"use":2086,"21":2087,"]<=":2088,"DEBUG":2089,"Ġ32":2090,"Ġgraph":2091,"Ġ{-":2092,"KKKKKK":2093,"\"\"":2094,"âĸĲ":2095,"00010":2096,"ĠĠĉ":2097,"Ġper":2098,"Ġrt":2099,"Ġzero":2100,"NN":2101,"sible":2102,"*-":2103,"print":2104,"Ġprimes":2105,"<<'\\":2106,"ik":2107,"Ġ(__":2108,"itr":2109,"debug":2110,"Ġare":2111,"Ġ100005":2112,"Ġhigh":2113,"NU":2114,"Ġdeb":2115,"fj":2116,"ctype":2117,"Ġ(\"%":2118,"âķ¬âķ¬":2119,"ĠVI":2120,"rc":2121,"ĠCLOCKS":2122,"ION":2123,"forn":2124,"Ġta":2125,"Ġcomma":2126,"ĠINT":2127,"ACK":2128,"25":2129,"264":2130,"Ġsync":2131,"Ġ-*-":2132,"â¢Ģ":2133,",\"":2134,"head":2135,"Ġbb":2136,"101":2137,"89":2138,"111":2139,"ĠInput":2140,"obj":2141,"ONG":2142,":::":2143,"parent":2144,"()))":2145,"Ġgen":2146,"Ġ~":2147,"Ġal":2148,"Ġhash":2149,"']":2150,";--":2151,"Ġqueue":2152,"OG":2153,"rint":2154,"Ġ\"%":2155,"47":2156,"Ġï¿½ï¿½ï¿½ï¿½ï¿½ï¿½":2157,"onoid":2158,"build":2159,"(\"\");":2160,",.":2161,"iter":2162,"deg":2163,"STACK":2164,"Ġbo":2165,"log":2166,"Ġgreater":2167,"Ġ1000000000":2168,"ĠZ":2169,"ask":2170,"result":2171,"PB":2172,"ud":2173,"rb":2174,"Ġ.:":2175,"Ġà¦":2176,"<<-":2177,"105":2178,"Ġ\"(\"":2179,"Ġrd":2180,"Ġoutput":2181,"child":2182,"000000":2183,"!=(":2184,"Ġ'-')":2185,"enter":2186,"'s":2187,"ry":2188,"Ġwith":2189,"big":2190,"cy":2191,"kk":2192,"));}":2193,"Ġmodular":2194,"14159265358979323846264":2195,"WKK":2196,"Ġloop":2197,"ĠPR":2198,"âĸĵ":2199,"fa":2200,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĉĉ":2201,"Ġscani":2202,"Ġlim":2203,"49":2204,"AME":2205,"fac":2206,"'||":2207,"ĠNode":2208,"Range":2209,"rs":2210,"@@@@@@@@":2211,"bo":2212,"maxi":2213,"--,":2214,"acos":2215,"Ġel":2216,"Ġcomplex":2217,"['":2218,"Ġmat":2219,"popcountll":2220,"DEEEE":2221,"Ġnormal":2222,"Ġwe":2223,"(#":2224,"ux":2225,"priority":2226,"Value":2227,"(\"%.":2228,"]='":2229,"Ġhell":2230,"67":2231,"action":2232,")]":2233,"[](":2234,"_|":2235,"Ġoth":2236,"ces":2237,"#####":2238,"Ġsm":2239,"ĉĉĉĉĉĉĉ":2240,"af":2241,")&":2242,")<<\"":2243,",:":2244,"ND":2245,"ny":2246,"po":2247,"]],":2248,"ain":2249,"1415926535897932384626433":2250,"}}":2251,"ded":2252,"upper":2253,"Ġ\"-":2254,"WWWWWWWWW":2255,"ĠJ":2256,"Ġvpii":2257,"Ġclr":2258,"Ġdeg":2259,"PII":2260,"ire":2261,"old":2262,"greater":2263,"ĠĠĠĠĉĉĉ":2264,"ors":2265,"Long":2266,"ri":2267,"Ġbfs":2268,"**/":2269,"Ġmaxi":2270,"Ġeb":2271,"Ġext":2272,"tc":2273,"Ġmacro":2274,"ope":2275,"OW":2276,"......":2277,"we":2278,"âłĢ":2279,"âĶĢâĶĢ":2280,"ĠĠĊ":2281,"Ġpath":2282,"umber":2283,"_(":2284,"Ġct":2285,"aken":2286,"here":2287,"80":2288,"do":2289,"Ġ`":2290,"Ġcase":2291,"mon":2292,"ai":2293,"NAME":2294,"Str":2295,"Ġtop":2296,"Input":2297,"ED":2298,"neg":2299,"__;":2300,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":2301,"blem":2302,"edges":2303,"Ġodd":2304,"ition":2305,"Ġchk":2306,"Ġfriend":2307,"****************************************************************":2308,"ĠPT":2309,"âĸĳâĸĳâĸĳ":2310,"derr":2311,"123":2312,"ho":2313,"visited":2314,"rg":2315,"ant":2316,"000000000":2317,"Ġvc":2318,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":2319,"ĉĉĉčĊ":2320,"();++":2321,"Ġï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½":2322,"sm":2323,"rev":2324,")((":2325,"ĠĠĠĠĠčĊ":2326,"/(":2327,"LI":2328,"tm":2329,"rent":2330,"()),":2331,"NOTES":2332,"Ġunordered":2333,"Ġorder":2334,"ara":2335,"qual":2336,"cept":2337,"CT":2338,"Ġpl":2339,"EM":2340,"54":2341,"Ġmerge":2342,"Ġme":2343,"Ġshift":2344,"âķĲâķ":2345,"&...":2346,"cmp":2347,"Ġ11":2348,"()==":2349,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":2350,"ies":2351,"pw":2352,"ump":2353,"ĠPrint":2354,"::::::::":2355,"sy":2356,"}\";":2357,")<<\"\\":2358,"namespace":2359,"bl":2360,"arry":2361,"Ġnl":2362,"Ġbr":2363,"isdigit":2364,"34567":2365,"Ġother":2366,"]]);":2367,"cctype":2368,"Ġ')":2369,"ACRO":2370,"fin":2371,"Ġfac":2372,",,,":2373,"Ġ\"]\";":2374,"888":2375,"ĠFAST":2376,"ek":2377,"Ġhtt":2378,"mag":2379,"Ġsec":2380,"66":2381,"PI":2382,"Ġmodint":2383,"14159265358979323846264338":2384,"my":2385,"Ġfo":2386,"upd":2387,"ĠSQ":2388,"texs":2389,"UN":2390,"ĠÐ":2391,"Ġdig":2392,"Ġ][":2393,"Ġpdd":2394,"1000000007":2395,"Ġmultiset":2396,"â¢¿":2397,"Ġwas":2398,"Ġ>::":2399,"Ġhead":2400,")>>":2401,"TS":2402,"Ġcross":2403,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":2404,"Ġ\"[\";":2405,"1005":2406,"ute":2407,"Ġrnd":2408,"path":2409,";;;":2410,"ĠLINF":2411,"bj":2412,"rest":2413,"oth":2414,"Ġkey":2415,"Iter":2416,"tail":2417,"multiset":2418,"cs":2419,"float":2420,"hite":2421,"Ġ];":2422,"pro":2423,"Ġvisited":2424,"bad":2425,"Ġtc":2426,"ieve":2427,"clz":2428,"........................":2429,"ear":2430,"jk":2431,"Ġmodul":2432,")<":2433,"ĠVector":2434,"disp":2435,"unc":2436,"imer":2437,"39":2438,"[++":2439,"del":2440,"Ġ12":2441,"Ġlst":2442,"Ġbound":2443,"--------------":2444,"nod":2445,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":2446,"Ġcont":2447,"Child":2448,"EK":2449,"WWWWW":2450,"ĠLD":2451,"ww":2452,"Ġfn":2453,"Ġlevel":2454,"Ġbinary":2455,"Ġ&_":2456,"Ġ(_":2457,"need":2458,"color":2459,"Ġfabs":2460,"ĠComp":2461,"68":2462,"cpp":2463,"search":2464,"0000000000":2465,"ĠĠĠĠĠĠĠĠĠĠĠĠčĊ":2466,"ivate":2467,"61":2468,"wt":2469,"ĠMin":2470,"ĠMonoid":2471,"Ġ\")\";":2472,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":2473,"Ġsign":2474,"Ġvar":2475,"exit":2476,"âĸĳâĸĳâĸĳâĸĳâĸĳâĸĳâĸĳâĸĳ":2477,"XX":2478,"raction":2479,"Ġnd":2480,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":2481,"Ġgood":2482,"Ġloc":2483,"Ġitr":2484,"1000000":2485,"100010":2486,"1415926535897932384626433832":2487,")+(":2488,"==-":2489,"atcher":2490,"Ġnx":2491,"================================":2492,"'\\":2493,"Ans":2494,"nn":2495,"Ġsd":2496,"Ġri":2497,"Ġthat":2498,"Ġacc":2499,"dispatcher":2500,"case":2501,"ĉĉĊ":2502,"ĠMEM":2503,"ASE":2504,"VI":2505,"&]":2506,"(#__":2507,"dy":2508,"Ġfa":2509,"Ġtuple":2510,"Ġ<<\"":2511,"iple":2512,"son":2513,"Ġhave":2514,"ĠDBN":2515,"EEEEEEEEEEEEEEEE":2516,"Ġ});":2517,"20000":2518,"Ġsy":2519,"ASK":2520,"Ġ\"{":2521,"ork":2522,"ource":2523,"ome":2524,"Ġlength":2525,"CLOCKS":2526,"Ġtwo":2527,"For":2528,"Ġeven":2529,"Ġ].":2530,"Ġ--------------------------------":2531,"Ġtp":2532,"dbg":2533,"Prime":2534,"ulate":2535,"fore":2536,"Ġlog":2537,"Ġvb":2538,"pha":2539,"erse":2540,"df":2541,"ĠNULL":2542,";}}":2543,"Sum":2544,"Le":2545,"Ġ1000000":2546,"Ġ200":2547,"1001":2548,"++--++--++--++--++--++--++--++--++--++--++--++--++--++--++--++--":2549,"ew":2550,"Ġcy":2551,"Ġerror":2552,"IME":2553,"comma":2554,"assign":2555,"Ġoff":2556,"cap":2557,"was":2558,"*****":2559,"ðŁ":2560,"()+":2561,"Ġuse":2562,"GGGDDDDDDDDDDDD":2563,"141592653589793238462643383279":2564,"Ġobj":2565,"ĠDI":2566,"depth":2567,";:":2568,"Con":2569,"tu":2570,"************************":2571,"ĠDFS":2572,"Ġ50":2573,"Ġstrlen":2574,"Ðµ":2575,"Ġ15":2576,"ĠOO":2577,");(":2578,"stdinPos":2579,"69":2580,"ish":2581,"300":2582,"Ġsin":2583,"ĠLong":2584,"ĠLOG":2585,"total":2586,"âłĢâłĢ":2587,"Ġcode":2588,"Ġdd":2589,"]:":2590,"[],":2591,"Ġrec":2592,"ĠPLL":2593,"cltype":2594,"Ġvpll":2595,"Ġargc":2596,"'t":2597,"sec":2598,"opy":2599,"),&(":2600,"'&&":2601,"LG":2602,"tp":2603,"stem":2604,"IL":2605,"Ġmini":2606,"ĠGet":2607,"freq":2608,"Array":2609,"stderr":2610,"Ġhere":2611,"Ġ[&]":2612,")++)":2613,"Ð¾":2614,"\",(":2615,"&&(":2616,"CH":2617,"AD":2618,"ĠRE":2619,"Ġmult":2620,"irection":2621,"Ġlg":2622,"Ġost":2623,"NUM":2624,"Ġfst":2625,"egment":2626,"Ġdelta":2627,"++++":2628,"ĠTR":2629,"Ġstringstream":2630,"Ġnodes":2631,"$$":2632,"KKKKKKKKKK":2633,"EEEEEEEEEEE":2634,"ser":2635,"07":2636,"Imp":2637,"fill":2638,"cast":2639,"Ġab":2640,"Ġara":2641,"41":2642,"anc":2643,"Ġqu":2644,"Ġĉĉĉ":2645,"ĠĠĠĉĉ":2646,"3333":2647,"[{":2648,"Ġcolor":2649,"Ġptr":2650,"Ġtriple":2651,")[":2652,"ĠAns":2653,"09":2654,"eps":2655,"macro":2656,"Ġpro":2657,"putchar":2658,"Ġdec":2659,"zero":2660,"vll":2661,"]>>":2662,"ä¸":2663,"Ġsk":2664,"Ġforr":2665,"Ġ----------------":2666,"]=-":2667,"ĠEOF":2668,"Ġchild":2669,"Ġmatrix":2670,"â¡¿":2671,"Ġbad":2672,"EED":2673,"63":2674,"MIN":2675,"Ġï¿½ï¿½ï¿½ï¿½ï¿½":2676,"44":2677,"128":2678,"lst":2679,"Ġ\".":2680,"KW":2681,"LGG":2682,"ĠmaxN":2683,"Ġrank":2684,"Ġ___":2685,"Ġ\"<<(":2686,"'+":2687,"me":2688,"sign":2689,"real":2690,"ĠTail":2691,"ĠMatrix":2692,"87":2693,"<='":2694,".......":2695,"ui":2696,"Ġiii":2697,"mini":2698,"Ġ200005":2699,"ĠMIN":2700,"CTION":2701,"level":2702,"Ġ!(":2703,"[])":2704,"msk":2705,"Ġdif":2706,"Ġspl":2707,"11111111":2708,"Power":2709,"qr":2710,"Ġalloc":2711,"51":2712,"Ex":2713,"Ġ19":2714,"down":2715,"lint":2716,"primes":2717,"ĠSolve":2718,"â£¯":2719,"Ġ++){":2720,"ere":2721,"ij":2722,"ile":2723,"rd":2724,"ĠULL":2725,"ated":2726,"ister":2727,"âĸĪâĸĪâķ":2728,"[\"":2729,"Ġtake":2730,"Ġpd":2731,"ĠAll":2732,"Ġbounds":2733,"dir":2734,"gister":2735,"Ġsgn":2736,"AA":2737,"Ġfprintf":2738,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":2739,"ĠFORE":2740,"Ġhttps":2741,"inp":2742,"Ġfunction":2743,"Ġinc":2744,"ĠAuthor":2745,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":2746,"ĠUn":2747,"Ġmm":2748,"ĠFILE":2749,"ick":2750,"Ġ'.')":2751,"small":2752,"number":2753,"locked":2754,"Ġwill":2755,"'},{":2756,"]-=":2757,"-=(":2758,"cross":2759,"}};":2760,"answer":2761,"Ġ500":2762,"))/":2763,"...);}":2764,"â£·":2765,"â£Ł":2766,"Ġqr":2767,"ĠVA":2768,"Ġyour":2769,"ization":2770,"EEK":2771,"fjt":2772,"SIZE":2773,"Ġfreq":2774,"ef":2775,"eed":2776,"&&...":2777,"()(":2778,"\",&(":2779,"hitespace":2780,"ï¿½ï¿½ï¿½":2781,"fst":2782,"Ġkol":2783,"Ġrest":2784,"Ġboost":2785,"ĠIN":2786,"^=":2787,"_,":2788,"Ġcr":2789,"Ġhas":2790,"ply":2791,"\";}":2792,"200000000":2793,">());":2794,"ref":2795,"Ġmemo":2796,"Ġ(-":2797,"Ġlca":2798,"+'":2799,"()->":2800,"side":2801,"DEF":2802,"MN":2803,"Mul":2804,"state":2805,"Ġ17":2806,"ev":2807,"mo":2808,"good":2809,"Ġstep":2810,"Ġ\");":2811,"Ġ60":2812,"]/":2813,"bin":2814,"Ġ{{":2815,"Ġppb":2816,"Ġ123":2817,"Ġny":2818,"]=='.":2819,"two":2820,"Ġ16":2821,"ĠDirection":2822,"ĉĠĠĠĠĠĠĠ":2823,"à§ĩ":2824,"Set":2825,"ĠMACRO":2826,"Ġvalues":2827,"ãĢ":2828,"ify":2829,")>":2830,"[*":2831,"()<<":2832,"valc":2833,"Ġreset":2834,"Ġsep":2835,"____________":2836,"()>":2837,"Ġargv":2838,"Ġ',');":2839,")=(":2840,"Ġsuf":2841,"vers":2842,"scan":2843,"110":2844,"Ġmove":2845,"////////////////////////////////////////////////////////////////":2846,"nk":2847,"uck":2848,"Ġdir":2849,"ĠĠĠĠĠĠčĊ":2850,"Ġflow":2851,"WKKKKK":2852,"Ġfx":2853,"Ġvd":2854,"jji":2855,"ï¼":2856,"Ġpo":2857,"ĠRA":2858,"Ġstream":2859,"Ġnargs":2860,"100100":2861,"sent":2862,"ĠFraction":2863,"Ġsl":2864,")];":2865,"Ġcap":2866,"Ġelement":2867,"Ġins":2868,"ĠST":2869,"ide":2870,"lb":2871,"Comp":2872,"âĸĪâĸĪâĸĪ":2873,"VEC":2874,"Ġback":2875,"ĠCL":2876,"elper":2877,"dif":2878,"nb":2879,"Ġpublic":2880,"nce":2881,"ĠModular":2882,"2000":2883,"sl":2884,"Ġxy":2885,"dq":2886,"orary":2887,"OL":2888,"PP":2889,"ossible":2890,"FFFF":2891,"UNCTION":2892,")=":2893,"even":2894,"!=-":2895,">();":2896,"Ġck":2897,"Ġlist":2898,"Ġ>(":2899,"ĠTT":2900,"IM":2901,"Ġsuff":2902,"Ġ*(":2903,"=((":2904,"Ġscl":2905,"Ġrs":2906,"form":2907,"Ġln":2908,"<<*":2909,"5555":2910,"Ġ--)":2911,"Ġ--;":2912,"Ġdown":2913,"Scan":2914,"Ġcand":2915,"block":2916,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĉ":2917,"vert":2918,"]&&":2919,"---":2920,"step":2921,"Ġ[&](":2922,"range":2923,"Ġce":2924,"olution":2925,"USE":2926,"Ġvp":2927,"Ġfori":2928,"Ġris":2929,":\"":2930,"Ġbl":2931,"ĠSP":2932,"Ġ'?":2933,"â£¿â¡":2934,"buff":2935,"Cnt":2936,"]==-":2937,"Ġ&=":2938,"Start":2939,"Ġsplit":2940,"Ġdone":2941,"Ġshort":2942,"raph":2943,"ure":2944,"altu":2945,"Ġui":2946,"Pow":2947,"Test":2948,"Ð°":2949,"ĉĠĉ":2950,"Ġref":2951,"ĠgetChar":2952,"perm":2953,"String":2954,"']++;":2955,"Ġsa":2956,"]!=-":2957,"ward":2958,"0000000":2959,"Ġfy":2960,"ĠInf":2961,"Ġbigmod":2962,"Ġfto":2963,"Ġmaxim":2964,"1234567":2965,"âĸĢâĸĦ":2966,"Bit":2967,"Vector":2968,"suf":2969,"Ġ\"}\";":2970,"sa":2971,"Ġio":2972,"Ġfd":2973,"stri":2974,")/(":2975,"ĠreadInt":2976,"_;":2977,"Ġ(~":2978,"Ġtrans":2979,"tint":2980,"SERT":2981,"End":2982,"100001":2983,"qq":2984,"var":2985,"Ġ>;":2986,"Ġte":2987,"Ġev":2988,"Ġkk":2989,"Ġstrchr":2990,"Ġdiv":2991,"IMP":2992,"Ġ{};":2993,"Ġfflush":2994,"Ġblock":2995,"ircle":2996,"ĠMA":2997,"ACE":2998,"Ġkek":2999,"Ġsieve":3000,"Ġ10000000":3001,"ĠĠĉĉ":3002,"Ġ;}":3003,"Ġpowmod":3004,"âĸĵâĸĵ":3005,"``":3006,"Ġlp":3007,"Ġva":3008,"Ġxxx":3009,"Ġjj":3010,"##~~":3011,"Ġwork":3012,"ĠRe":3013,"ucl":3014,"Ġcarry":3015,"tain":3016,"SU":3017,"tests":3018,"%%%%":3019,"Ġus":3020,"Ġsrand":3021,"Ġerase":3022,"âĢ":3023,"Ġford":3024,"ingle":3025,"Ġ'*":3026,"table":3027,"Ġdq":3028,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":3029,"Th":3030,"lvl":3031,"Ġlol":3032,"tri":3033,"'},{'.":3034,"Ġmodulus":3035,"inc":3036,"ctz":3037,"have":3038,"AB":3039,"]<<'":3040,"lc":3041,"entr":3042,"itt":3043,"unlocked":3044,"]]--;":3045,"Ġforeach":3046,"To":3047,"jti":3048,"Ġimp":3049,"WWK":3050,"WWKK":3051,"KKKKW":3052,"##_":3053,"ia":3054,"lg":3055,"++]=":3056,"Ġbits":3057,"ĠFF":3058,"trie":3059,"âĸĳâĸĳâĸĳâĸĳâĸĳ":3060,"]!='":3061,"ðŁĴ":3062,"cxx":3063,"ya":3064,"ðŁĴ©":3065,"='":3066,"Whitespace":3067,"Ġdr":3068,"FUNCTION":3069,"srand":3070,"hich":3071,"Inverse":3072,"Ùİ":3073,"Ġnn":3074,"Ġdot":3075,";(":3076,"ĠĠĠĠĠĠĠĠĊ":3077,"rec":3078,"''":3079,",...)":3080,"matrix":3081,"register":3082,"Helper":3083,"Ġmon":3084,"Ġrc":3085,"Ġwin":3086,"vals":3087,"graph":3088,"Ġtin":3089,"close":3090,"lca":3091,"Ġrg":3092,"________________________________":3093,"ĠTime":3094,"owel":3095,"ĠLLONG":3096,"200000":3097,"]?":3098,"uk":3099,"}//":3100,"Ġna":3101,"Ġve":3102,"exponent":3103,"ãģ":3104,"<<\"[":3105,"Ġprefix":3106,"Ġvertexs":3107,"tic":3108,"erence":3109,"ÑĤ":3110,"++];":3111,"Ġgrid":3112,"DB":3113,"ebug":3114,"ĠSIZE":3115,"DL":3116,"mk":3117,"Ġcs":3118,"Ġls":3119,"Ġaux":3120,"Ġrun":3121,"ID":3122,"ĠFast":3123,"-----":3124,"imag":3125,"Ġsmall":3126,"Ġover":3127,"Ġeprintf":3128,"Ġ'#":3129,"Ġchr":3130,"valid":3131,"228":3132,"done":3133,"=\"\";":3134,"ðŁĴ©ðŁĴ©":3135,"<_":3136,"store":3137,"Ġsout":3138,"Ġprv":3139,"]*(":3140,"nom":3141,"â£»":3142,"â£½":3143,";;;;;;":3144,"Ġthan":3145,"ru":3146,"Ġfaltu":3147,"Ġ'\"":3148,"Ġwr":3149,">='":3150,"(++":3151,"UL":3152,"Ġmii":3153,"apsed":3154,"()));":3155,"Re":3156,"lp":3157,"Ġchange":3158,"otate":3159,"oraryNode":3160,"Ġwhat":3161,"rng":3162,"<<\"-":3163,"ers":3164,"Ġdsu":3165,"))*":3166,",__":3167,"^(":3168,"uf":3169,"defor":3170,"GGGGGGGGGGGGGGGG":3171,"deforces":3172,")<(":3173,"KKKKKKKKKKKKKKK":3174,"WWWWWWWWWWW":3175,"DDDDDDDDDDD":3176,"EEEK":3177,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":3178,"ASSERT":3179,"EMP":3180,"cb":3181,"nl":3182,"nr":3183,"uu":3184,"];}":3185,"ĠNumber":3186,"Ġcenter":3187,"Ġfoo":3188,"Ġ>,":3189,"ĠThe":3190,"ĠModInt":3191,")-(":3192,"dot":3193,"kol":3194,"Ġlvl":3195,"Ġtail":3196,">>;":3197,"Ġstack":3198,"distance":3199,"]]==":3200,"Ġask":3201,"Ġbeg":3202,"Ġopt":3203,"eing":3204,"arge":3205,"à¦¾":3206,"ĠTRACE":3207,"ARY":3208,"div":3209,"/************************************************":3210,"SS":3211,"Ġsiz":3212,"ĠUN":3213,"cpy":3214,"move":3215,"ĠĠĠĠĉĉĉĉ":3216,"ĠĠĠĠĠĠĠčĊ":3217,"Ġtests":3218,"Ġmultiply":3219,"%(":3220,"Ġfloat":3221,":..":3222,"EN":3223,"Ġcopy":3224,"angle":3225,"Pro":3226,"ey":3227,"ov":3228,"ĠĠĠĠĠĠĠĠĉ":3229,"oup":3230,"ĠBig":3231,"Ġpat":3232,"<<\",":3233,"Ġstate":3234,"ĠDP":3235,"ĠEX":3236,"MAT":3237,"nect":3238,"***":3239,"Ġpiii":3240,"Ġfiles":3241,"âķ¬âķ¬âķ¬âķ¬":3242,"PT":3243,"Ġiiii":3244,"ifstream":3245,"argv":3246,"IntegerRange":3247,"98":3248,"Add":3249,"Ġpli":3250,"Ġwhich":3251,"Ġ(!(":3252,"ts":3253,"Ġ();":3254,"ROW":3255,"âĸĢâĸĢâĸĢâĸĢ":3256,"Ġrandom":3257,"\"[":3258,"FL":3259,"Se":3260,"utation":3261,"****************************************":3262,"99999999":3263,"Ġĉĉĉĉ":3264,"Ġmodnum":3265,"::.":3266,"Ġinfo":3267,"ĠGCD":3268,"Ġprecalc":3269,"Data":3270,"undef":3271,"Ġcomb":3272,"PUT":3273,"Ġ2000000000":3274,"ĠFORD":3275,"Impossible":3276,"hell":3277,"ba":3278,"gg":3279,"tti":3280,"vii":3281,"Ġlhs":3282,"Ġfir":3283,"Ġso":3284,"ffff":3285,"Ġsolution":3286,"dec":3287,"Ġones":3288,"\"]":3289,"Dist":3290,"Number":3291,"ĠIt":3292,"Ġfactor":3293,"TASK":3294,"nax":3295,"][(":3296,"ress":3297,"]]]]":3298,"cx":3299,"la":3300,"alpha":3301,"umulate":3302,"EEEEEE":3303,"Ġminim":3304,"oose":3305,"**************/":3306,"Ġfound":3307,"EEEEE":3308,"Ġvalid":3309,"ĠisPrime":3310,"Ġpoints":3311,"LD":3312,"==(":3313,"Ġdivi":3314,"plus":3315,"=*":3316,"OME":3317,"505":3318,"ersect":3319,"400":3320,">'":3321,"merge":3322,"ways":3323,"wr":3324,"Ġisp":3325,"Left":3326,"<'":3327,"ĉĉĠĠĠ":3328,"Ġdor":3329,"MMM":3330,"ĠIter":3331,"eb":3332,"lft":3333,"Ġgot":3334,"ĠSQR":3335,"256":3336,"=_":3337,"Ġï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½":3338,">(),":3339,"mint":3340,"fter":3341,"bt":3342,"lol":3343,"}*/":3344,"\"),":3345,"Ġconstexpr":3346,"Ġcurrent":3347,"loc":3348,"error":3349,"nodes":3350,":::::":3351,"('\\":3352,"ĠEND":3353,"):(":3354,"Ġlc":3355,"5005":3356,"','.','.','.','.','.','.','.','.":3357,"eks":3358,"pc":3359,"Ġwhere":3360,"ĠSt":3361,"Ġvals":3362,"Ġdistance":3363,"Len":3364,"stra":3365,"Ġyes":3366,"Ġcn":3367,"ĠRep":3368,"Ġchrono":3369,"Ar":3370,"VER":3371,"ĠName":3372,"45":3373,"Read":3374,"Ġfs":3375,">>>":3376,"ĠEnd":3377,"(&":3378,"ipper":3379,"Ġ@":3380,");++(":3381,"(')":3382,"[_":3383,"og":3384,"Ġmaxx":3385,",,,,,,":3386,"pause":3387,"Id":3388,"ader":3389,"invd":3390,"prod":3391,"Ġqq":3392,"|(":3393,"Ñģ":3394,"Ġ[](":3395,");--":3396,"])+":3397,">()":3398,"CA":3399,"IG":3400,"bution":3401,"â£¿â£¿â£¿â£¿â£¿â£¿":3402,"/**************":3403,"EG":3404,"fabs":3405,"olower":3406,"uffer":3407,"1000005":3408,"src":3409,"Ġ**************/":3410,"Ġ<<(":3411,"prot":3412,"=='-')":3413,"sx":3414,"Ġopen":3415,"ions":3416,"Ġ~(":3417,"decltype":3418,"INES":3419,"######":3420,"MATH":3421,"acti":3422,"Ġ\"!":3423,"lear":3424,"ĉĉĉĉĉĉĉĉ":3425,"~~~~":3426,"ĠCLR":3427,"siz":3428,"Ġbug":3429,"DEFINES":3430,"One":3431,"[__":3432,"//*":3433,"Ġ\"#":3434,"(){}":3435,"fir":3436,"war":3437,"00001":3438,"Ġinp":3439,"@@@@@@@@@@@@@@@@":3440,"Ġ\"{\";":3441,"Ġlink":3442,"Ġlld":3443,"haust":3444,"Ġwho":3445,"problem":3446,"center":3447,"ql":3448,"wa":3449,"ueries":3450,"Ġscn":3451,"Ġdiag":3452,"Ġfunc":3453,"ould":3454,"fn":3455,"ger":3456,"inter":3457,"rect":3458,"Ġql":3459,"ceil":3460,"Ġcounter":3461,"bbbb":3462,"DK":3463,"the":3464,"Ġist":3465,"ĠGET":3466,"hausted":3467,"Double":3468,"bas":3469,"Ġmas":3470,"(\"/":3471,"WWWWWK":3472,",,,,,,,":3473,"WWWKK":3474,"WWWKKK":3475,"Ġshow":3476,"Ġ...:.":3477,"âĸĴâĸĴâĸĴâĸĴâĸĴâĸĴ":3478,"na":3479,"private":3480,"Ġncr":3481,"prv":3482,"ORT":3483,"stribution":3484,"__);":3485,"*=(":3486,"Ġsnd":3487,"Ġ++__":3488,"++;}":3489,"Ġgoa":3490,"Ġarea":3491,"1234":3492,"ield":3493,"prefix":3494,"bal":3495,"),_":3496,"ffl":3497,"protector":3498,"&-":3499,"BS":3500,"(!(":3501,"ecial":3502,"Ġlf":3503,"ended":3504,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":3505,"Ġ\"[\"":3506,"system":3507,"72":3508,"DEB":3509,"OO":3510,"nm":3511,"vc":3512,"lete":3513,"(((":3514,"Ġ1000000000000000000":3515,"ĠHead":3516,"Ġgener":3517,"'},{'.','.','.','.','.','.','.','.','.":3518,"IntegerIterator":3519,"Ð½":3520,"Ġni":3521,"Ġ18":3522,"Ġtaken":3523,"akh":3524,"||(":3525,"Ġreal":3526,"Ġprivate":3527,"ĠNIL":3528,"ĠRFOR":3529,"[--":3530,"çļ":3531,"Ġnr":3532,"lect":3533,"alf":3534,"Ġ29":3535,"Ġpri":3536,"ĠtemporaryNode":3537,"Ġmonth":3538,"çļĦ":3539,")!=":3540,"Ġsim":3541,"IMPL":3542,"BC":3543,"Ġcp":3544,"ĠmodMul":3545,"Ġ1000000009":3546,"ĠĠĠĊ":3547,"setf":3548,"ĠOUT":3549,"::::::":3550,":::::::":3551,"Ġ----------------------------------------------":3552,"iform":3553,"ĠSet":3554,"647":3555,"geeks":3556,"plic":3557,"bigmod":3558,"Ġam":3559,"Ġng":3560,"lev":3561,"age":3562,"âłĽ":3563,"90":3564,"Ġty":3565,"Ġ25":3566,"maxx":3567,"Ġuni":3568,"distribution":3569,"Buffer":3570,"win":3571,"org":3572,"Ġpld":3573,"â£¾":3574,"very":3575,"azu":3576,"2005":3577,"ĠAllah":3578,"Hash":3579,"suff":3580,"Ġer":3581,"==\"":3582,"off":3583,"ĠCode":3584,"\",\"<<":3585,"Ġexponent":3586,"Ġceil":3587,"(*(":3588,"day":3589,"oin":3590,"ĠFirst":3591,"Args":3592,":\\":3593,"hing":3594,"ĠNO":3595,"lt":3596,"nw":3597,"snd":3598,"})":3599,"Ġmsk":3600,"Ġbp":3601,"ĠSH":3602,"ĠCon":3603,"Ġ-->":3604,"Ġbuff":3605,"65":3606,"has":3607,"mult":3608,"ĠAdd":3609,"/__":3610,"FN":3611,"Ġdef":3612,"Ġï¿½":3613,"ument":3614,",,,,,,,,,,,,,,,,":3615,")?(":3616,"35":3617,"<<\"]":3618,"Ġ{+":3619,"Ġtable":3620,"70":3621,"}});":3622,"Ġts":3623,"Ġbinpow":3624,"':":3625,"DP":3626,"EL":3627,"Ġremove":3628,"Ġaccumulate":3629,"ĉĠĠ":3630,"Ġnw":3631,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠčĊ":3632,"Ġtrie":3633,"Ġord":3634,"âĸĦâĸĦâĸĦâĸĦ":3635,"KEE":3636,"Ġra":3637,"ofstream":3638,"ukazu":3639,"iw":3640,"ĠØ":3641,"Ġsolver":3642,"Ġtransform":3643,"Ġdeque":3644,"Ġvvll":3645,">{":3646,"acc":3647,"1024":3648,"âłĺ":3649,"By":3650,"Ġim":3651,"Ġnullptr":3652,"entroid":3653,"DEE":3654,"DEEE":3655,"Oper":3656,"PC":3657,"WKKKK":3658,"()]":3659,"ĠTargs":3660,"Ġmodify":3661,"Ġtri":3662,"WWWWWWWWWWWW":3663,"âĸĦâĸĢ":3664,"93":3665,"ĠPQ":3666,"ĠIT":3667,"CHAR":3668,"Ġ--------------------":3669,"yes":3670,"seq":3671,"Ġsame":3672,"ĠTree":3673,"MS":3674,"]});":3675,"va":3676,"Ġcum":3677,"enti":3678,"modular":3679,"ĠĠĠĠĠĠĠĠĠĠčĊ":3680,"Ġsegment":3681,")&&":3682,"And":3683,"ner":3684,"Ġ#__":3685,"ĠLine":3686,"ĠGod":3687,"readType":3688,"âĸĪâĸĪâĸĪâĸĪâĸĪâĸĪâĸĪâĸĪ":3689,"Ġbigint":3690,"other":3691,"300005":3692,"beg":3693,"__(":3694,"337":3695,"TESTS":3696,")][":3697,"eld":3698,"Ġmint":3699,"Ġ|_|":3700,"dsu":3701,"Ġelapsed":3702,"##~~##~~":3703,"Ġ('":3704,"Ġcall":3705,"Ġllong":3706,"ĠreadChar":3707,"codeforces":3708,"â¢¸":3709,"FILENAME":3710,"1415926535897932384626433832795":3711,"62":3712,";//":3713,"mq":3714,"oi":3715,"Ġfft":3716,"Ġinverse":3717,"Ġ48":3718,"argc":3719,"mode":3720,"ĠDEB":3721,"Ġatan":3722,"grid":3723,"ĠmodInverse":3724,"ĠDice":3725,"Ġdivis":3726,"boost":3727,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":3728,"gt":3729,"ple":3730,"ĠTIME":3731,"take":3732,"ÐĲ":3733,"Ġ....":3734,"(\".":3735,"Ġlimit":3736,"ĠREV":3737,"]=='.')":3738,"';}":3739,"Tr":3740,"ĠSegment":3741,"8888888":3742,"Ġlocal":3743,"//}":3744,"Ġdim":3745,"Ġ300":3746,"\":\"":3747,"Idx":3748,"tx":3749,"Ġvpi":3750,"Ġday":3751,"âķĲâķ¦":3752,"âķĲâķ©":3753,"ren":3754,">>>>":3755,"versed":3756,"vertexs":3757,"Ġ62":3758,"âķĲâķĲ":3759,"eap":3760,";};":3761,"AND":3762,"Ġskip":3763,"147":3764,"Des":3765,"Ej":3766,"Ġ2000":3767,"Ġostringstream":3768,"997":3769,"ĠreadType":3770,"Ġflush":3771,"MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM":3772,";\\":3773,"Segment":3774,"ĉĉĉĉčĊ":3775,"ĠROF":3776,".........":3777,"ĠUpdate":3778,"uffle":3779,"ĠDBG":3780,"permutation":3781,",;;":3782,"hod":3783,")<=":3784,"ĠCom":3785,"illah":3786,"510":3787,"ĠÃ":3788,"Ġact":3789,"ĠdPower":3790,"Ġxs":3791,"loor":3792,"2222":3793,"################################################################":3794,"Use":3795,"Ġlft":3796,"Ġpil":3797,"strlen":3798,"Ġgetline":3799,"memo":3800,"'];":3801,"Right":3802,"Ġns":3803,"ĠTES":3804,"Ġwt":3805,"])-":3806,"88888":3807,"heck":3808,")//":3809,"Solve":3810,"px":3811,"Ġ<<=":3812,"ĠSET":3813,"Ġpresent":3814,"app":3815,"Ġang":3816,"Di":3817,"tj":3818,"arn":3819,"Ġho":3820,"Ġdbl":3821,"factor":3822,"Ġchkmax":3823,"IE":3824,"eq":3825,"onenti":3826,"Ġ++_":3827,"888888":3828,"Num":3829,"UE":3830,"night":3831,"ostringstream":3832,"same":3833,"Ġsx":3834,"+=\"":3835,"ORARY":3836,"EMPORARY":3837,"Pr":3838,"nost":3839,"vvi":3840,"ĠnValue":3841,"ĠfastIO":3842,"sqr":3843,"'))":3844,"AM":3845,"rhs":3846,"Ġ\"\"":3847,"fflush":3848,"Ð¸":3849,"ÑĢ":3850,"Ġlint":3851,"Of":3852,"ys":3853,"Ġero":3854,"Ġdc":3855,"ĠMS":3856,"change":3857,"Ġstk":3858,"resolution":3859,"Contain":3860,"gc":3861,"Ġro":3862,"ĠSL":3863,"EEEEEEE":3864,"Ġempty":3865,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĉ":3866,")>=":3867,"288":3868,"WKKKKKKKK":3869,"author":3870,"Ġaaa":3871,"++);":3872,"WWKKK":3873,"EEEEEEEEEE":3874,"Ġ.:.":3875,"WWWWWWWWWW":3876,"DDDDDDDDDD":3877,"Ġ...,.":3878,"KKKKKKKKKKKKKKKKKKKKKKKK":3879,"Ġonly":3880,"tfLGG":3881,"403":3882,"â¢Ģâ¢Ģ":3883,"serve":3884,"//*//*":3885,"da":3886,"ei":3887,"xy":3888,"Ġpol":3889,"Ġenable":3890,"Ġdiagnost":3891,"Ġdiagnostic":3892,"DI":3893,"Ġvvl":3894,"Ġ100100":3895,"cepted":3896,"++++++++":3897,"ml":3898,"Ġfix":3899,"Ġtimer":3900,"Ġ200000":3901,"200010":3902,"Mode":3903,"PLL":3904,"np":3905,"not":3906,"Ġnod":3907,"conj":3908,"ĠSS":3909,"Ġ\\\\":3910,"14159265359":3911,"Ġlet":3912,"idul":3913,"ĠprContain":3914,"ĠCO":3915,"ĠPRINT":3916,"eded":3917,"(\"<<":3918,"ĠPro":3919,"âķĲâķ¦âķĲâķ©":3920,"Ġlnum":3921,"ocess":3922,"(_)":3923,"warukazu":3924,"'},{'.','.','.','.','.','.','.','.','.'},{'.','.','.','.','.','.','.','.','.":3925,"found":3926,"sd":3927,"ithub":3928,"ERO":3929,"*)":3930,"carry":3931,"Ġ'-'":3932,"Ġprec":3933,"Ġchkmin":3934,"ONLINE":3935,"ise":3936,"Ġclear":3937,"Ġtout":3938,"Ġini":3939,"Ġchoose":3940,"abc":3941,")].":3942,"AH":3943,"Ġ**":3944,"Ġcal":3945,"Ġap":3946,"){}":3947,"ĠAl":3948,"Index":3949,"âĸĪâĸĪâķĳ":3950,"ĠĠĠĉĉĉ":3951,"ĠFIN":3952,"Ġexhausted":3953,"ations":3954,"CC":3955,"who":3956,"Ġnp":3957,"Ġdud":3958,"Ġansw":3959,"Ġargument":3960,"MXN":3961,"Ġ14":3962,"+='":3963,"âł¹":3964,"limit":3965,"483":3966,"Ġvertex":3967,"ĠFILL":3968,"Exp":3969,"cum":3970,"match":3971,"Ġfen":3972,"ĠSORT":3973,"Ġ'?')":3974,"Al":3975,"CM":3976,"ĠBIT":3977,"(~":3978,"Ġds":3979,"Ġjt":3980,"Ġrge":3981,"Ġprod":3982,"Ġsystem":3983,"14159265358979323846264338327950":3984,"LOG":3985,"#######":3986,"Ġ100010":3987,"score":3988,"maining":3989,"Arrays":3990,"Path":3991,"Ð»":3992,"rease":3993,"ĠGraph":3994,"ally":3995,";;;;;;;":3996,"Ġnumbers":3997,"Last":3998,"github":3999,"Ġay":4000,"Ġmll":4001,"ĠCON":4002,"Ġview":4003,"hh":4004,"lhs":4005,"reate":4006,"Ġrepd":4007,"))))":4008,"friend":4009,"fun":4010,"Ġ'('":4011,"Ġchmin":4012,"Ġ1000005":4013,"]->":4014,"inverse":4015,"Ġ\"\")":4016,"Ġeach":4017,"((*":4018,"ĠEdge":4019,"-');":4020,"Head":4021,"Ġcx":4022,"Ġcor":4023,"Ġ*__":4024,"Init":4025,"ĠxyPoint":4026,"=%":4027,"]%=":4028,"ao":4029,"<<__":4030,"ĠTs":4031,"kek":4032,"ĠBU":4033,"active":4034,"Res":4035,"py":4036,"Ġ&(":4037,"Maxn":4038,"################################################":4039,"ersection":4040,"versedIntegerRange":4041,"Single":4042,"Ġinter":4043,"Ġresp":4044,"chk":4045,"Ġdecltype":4046,"1828":4047,"ĠInteger":4048,"Ġhoge":4049,"Equal":4050,"over":4051,"Ġsw":4052,"Ġsfl":4053,"Ġ40":4054,"ATE":4055,"Pair":4056,"ins":4057,"Ġsb":4058,"Ġeq":4059,"Ġ/\\":4060,"current":4061,"Ġreplace":4062,"VAR":4063,"run":4064,"Ġchmax":4065,"height":4066,"Ġsource":4067,"Ġtimes":4068,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":4069,"Ġ\\|":4070,"tolower":4071,"Ġ(#":4072,"Ġtim":4073,"Ġtag":4074,"let":4075,"ĠTH":4076,"Ġequal":4077,")).":4078,"â¢»":4079,"=='\\":4080,"onentiation":4081,"'][":4082,"fp":4083,"Ġ..":4084,