{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"A":37,"B":38,"C":39,"D":40,"E":41,"F":42,"G":43,"H":44,"I":45,"J":46,"K":47,"L":48,"M":49,"N":50,"O":51,"P":52,"Q":53,"R":54,"S":55,"T":56,"U":57,"V":58,"W":59,"X":60,"Y":61,"Z":62,"[":63,"\\":64,"]":65,"^":66,"_":67,"`":68,"a":69,"b":70,"c":71,"d":72,"e":73,"f":74,"g":75,"h":76,"i":77,"j":78,"k":79,"l":80,"m":81,"n":82,"o":83,"p":84,"q":85,"r":86,"s":87,"t":88,"u":89,"v":90,"w":91,"x":92,"y":93,"z":94,"{":95,"|":96,"}":97,"~":98,"¡":99,"¢":100,"£":101,"¤":102,"¥":103,"¦":104,"§":105,"¨":106,"©":107,"ª":108,"«":109,"¬":110,"®":111,"¯":112,"°":113,"±":114,"²":115,"³":116,"´":117,"µ":118,"¶":119,"·":120,"¸":121,"¹":122,"º":123,"»":124,"¼":125,"½":126,"¾":127,"¿":128,"À":129,"Á":130,"Â":131,"Ã":132,"Ä":133,"Å":134,"Æ":135,"Ç":136,"È":137,"É":138,"Ê":139,"Ë":140,"Ì":141,"Í":142,"Î":143,"Ï":144,"Ð":145,"Ñ":146,"Ò":147,"Ó":148,"Ô":149,"Õ":150,"Ö":151,"×":152,"Ø":153,"Ù":154,"Ú":155,"Û":156,"Ü":157,"Ý":158,"Þ":159,"ß":160,"à":161,"á":162,"â":163,"ã":164,"ä":165,"å":166,"æ":167,"ç":168,"è":169,"é":170,"ê":171,"ë":172,"ì":173,"í":174,"î":175,"ï":176,"ð":177,"ñ":178,"ò":179,"ó":180,"ô":181,"õ":182,"ö":183,"÷":184,"ø":185,"ù":186,"ú":187,"û":188,"ü":189,"ý":190,"þ":191,"ÿ":192,"Ā":193,"ā":194,"Ă":195,"ă":196,"Ą":197,"ą":198,"Ć":199,"ć":200,"Ĉ":201,"ĉ":202,"Ċ":203,"ċ":204,"Č":205,"č":206,"Ď":207,"ď":208,"Đ":209,"đ":210,"Ē":211,"ē":212,"Ĕ":213,"ĕ":214,"Ė":215,"ė":216,"Ę":217,"ę":218,"Ě":219,"ě":220,"Ĝ":221,"ĝ":222,"Ğ":223,"ğ":224,"Ġ":225,"ġ":226,"Ģ":227,"ģ":228,"Ĥ":229,"ĥ":230,"Ħ":231,"ħ":232,"Ĩ":233,"ĩ":234,"Ī":235,"ī":236,"Ĭ":237,"ĭ":238,"Į":239,"į":240,"İ":241,"ı":242,"Ĳ":243,"ĳ":244,"Ĵ":245,"ĵ":246,"Ķ":247,"ķ":248,"ĸ":249,"Ĺ":250,"ĺ":251,"Ļ":252,"ļ":253,"Ľ":254,"ľ":255,"Ŀ":256,"ŀ":257,"Ł":258,"ł":259,"Ń":260,"in":261,"ĉĉ":262,"int":263,"de":264,"Ġ=":265,"st":266,"Ġ<":267,");":268,"re":269,"Ġi":270,"def":271,"or":272,"Ġ(":273,"on":274,"ine":275,"define":276,"ĉĉĉ":277,"Ġl":278,"se":279,"Ġm":280,"Ġa":281,"Ġn":282,"++":283,"Ġ1":284,"cl":285,"00":286,"Ġ{":287,"Ġp":288,"Ġ0":289,"if":290,"ou":291,"Ġc":292,"for":293,"ll":294,"ur":295,"en":296,"()":297,"clu":298,"inclu":299,"include":300,"ret":301,"**":302,"ĉĉĉĉ":303,"Ġ<<":304,"urn":305,"return":306,"std":307,"--":308,"Ġs":309,"Ġ+":310,"Ġ>":311,"ong":312,"//":313,"Ġv":314,"..":315,"out":316,"it":317,"Ġ-":318,"ac":319,"Ġ\"":320,"am":321,"Ġint":322,"<<":323,"an":324,"];":325,"Ġt":326,"Ġb":327,"con":328,"at":329,"Ġlong":330,"][":331,"er":332,"ing":333,"yp":334,"ir":335,"us":336,"le":337,"++)":338,"ct":339,"Ġx":340,"Ġ&":341,"Ġd":342,"end":343,"Ġf":344,"typ":345,"\",":346,"Ġma":347,"(\"":348,"id":349,"al":350,"ar":351,"KK":352,"Ġ*":353,"ame":354,"ect":355,"si":356,"){":357,"mp":358,"ector":359,"****":360,"__":361,"ze":362,"type":363,"Ġ>>":364,"::":365,"Ġstd":366,"cout":367,"const":368,"cin":369,"0000":370,"].":371,"op":372,"==":373,"str":374,"Ġj":375,"ue":376,"os":377,"ĠT":378,"ĠĠ":379,"Ġr":380,"typedef":381,"ma":382,"Ġ==":383,"air":384,"WW":385,"();":386,"nt":387,"ol":388,"el":389,"EE":390,"Ġll":391,"size":392,"using":393,"hi":394,"ace":395,"ack":396,"ti":397,"Ġ}":398,"ans":399,"Ġ'":400,"sp":401,"else":402,">>":403,"emp":404,"Ġname":405,"od":406,"ut":407,"io":408,"Ġfor":409,"Ġ2":410,"Ġan":411,"space":412,"Ġy":413,"##":414,"----":415,"ate":416,"string":417,"eg":418,"Ġnamespace":419,"],":420,"))":421,"(\"%":422,"oid":423,"back":424,"vector":425,"Ġre":426,"Ġreturn":427,"endl":428,"ush":429,"um":430,"Ġ;":431,"....":432,"Ġk":433,"set":434,"Ġans":435,"Ġmain":436,"as":437,"Ġu":438,"pr":439,"âĸ":440,"])":441,"egin":442,"ĠM":443,"whi":444,"Ġ%":445,"irst":446,"while":447,"bit":448,"begin":449,"Ġg":450,"Ġ<=":451,"ĉĠ":452,"temp":453,"LL":454,"ble":455,"ow":456,"ch":457,"can":458,"stre":459,"Ġ,":460,"stream":461,"cond":462,"!=":463,"********":464,"late":465,"second":466,"ith":467,"DD":468,"Ġif":469,"ii":470,"Ġin":471,"ouble":472,"Ġ++":473,"template":474,"ĠĊ":475,"void":476,"]=":477,"xt":478,"Ġvector":479,"ed":480,"bits":481,"<<\"":482,"stdio":483,"Ġpair":484,"++.":485,"Ġ+=":486,"stdc":487,"canf":488,"ĉĉĉĉĉ":489,"]);":490,"Ġ)":491,"Ġcout":492,"Ġ&&":493,"ase":494,"tie":495,"KKKK":496,"<=":497,"),":498,"(),":499,"pair":500,"\";":501,"ve":502,"++;":503,"ool":504,"intf":505,"88":506,"ename":507,"Ġendl":508,"Ġ:":509,"et":510,"ass":511,"ĠN":512,"ad":513,"nc":514,"Ġcon":515,"));":516,"Ġpr":517,"Ġ|":518,"me":519,"push":520,"alse":521,"with":522,"IN":523,"¿½":524,"ï¿½":525,"Ġmod":526,"ator":527,"sy":528,"Ġ/":529,"line":530,"erator":531,"Ġe":532,"class":533,"Ġ!=":534,"long":535,"sync":536,"ĠF":537,"ĠA":538,"open":539,"put":540,"Ġcin":541,"Ġmax":542,"max":543,"Ġdouble":544,").":545,"first":546,"10":547,"ode":548,"reopen":549,"--------":550,"ke":551,"Ġq":552,"of":553,"ĉĊ":554,"bool":555,"rt":556,"Ġres":557,"dp":558,"is":559,"EEEE":560,"...":561,"â£":562,"cnt":563,"////":564,"pb":565,"scanf":566,"WWWW":567,"ree":568,"ĠS":569,"ĠP":570,"++){":571,"ï¿½ï¿½":572,"####":573,"gn":574,"base":575,"MM":576,"Ġop":577,";}":578,"uto":579,"ize":580,"ot":581,"Ġtr":582,"Ġfirst":583,"())":584,"res":585,"char":586,"OD":587,"=(":588,"un":589,"Ġ__":590,"ag":591,"typename":592,"que":593,"Ġ>=":594,"Ġpush":595,"Ġit":596,"AX":597,"Ġ3":598,"Ġ_":599,"Ġconst":600,"Ġar":601,"Ġmin":602,"........":603,"map":604,"ic":605,"};":606,"printf":607,"he":608,"Ġw":609,"ul":610,"ist":611,"ĉĉĉĉĉĉĉĉ":612,"nd":613,"____":614,"((":615,"auto":616,"Ġsecond":617,"00000000":618,";;":619,"cur":620,"ios":621,"mod":622,"';":623,"Ġpb":624,"tin":625,"sert":626,"ast":627,"ort":628,"txt":629,"Ġmake":630,"freopen":631,"64":632,"bu":633,"inline":634,"ĠR":635,"****************":636,"Ġdp":637,"err":638,"Ġ//":639,"false":640,",,":641,"ge":642,"val":643,"Ġval":644,"+=":645,"--)":646,"min":647,"fs":648,"ĠL":649,"â£¿":650,"')":651,"Ġcnt":652,"ck":653,"Ġo":654,"olve":655,"Ġst":656,"(){":657,"GG":658,"âĸĳ":659,"Ġmp":660,"Ġ\"<<":661,"Ġch":662,"ig":663,"om":664,"sum":665,"tr":666,"ak":667,"Ġh":668,"ĠMOD":669,"arr":670,"pos":671,"Ġ||":672,"Ġ((":673,"sign":674,"000":675,"Ġsz":676,"====":677,">=":678,"pp":679,"DDDD":680,"\",&":681,"ime":682,"());":683,"il":684,"Ġoperator":685,"\");":686,"node":687,"Ġget":688,"ind":689,"ap":690,"orde":691,"ĠC":692,"ĠG":693,"INF":694,"Ġall":695,"cd":696,"11":697,"OR":698,"]==":699,"ount":700,"Ġscanf":701,"ĠD":702,"--;":703,"ĉĉĠ":704,",-":705,"Ġde":706,"ext":707,"queue":708,"mat":709,"double":710,"endif":711,"\")":712,"signed":713,"up":714,"tinue":715,"Ġtrue":716,"Ġvoid":717,"reak":718,"iostream":719,"Ġelse":720,"lld":721,"ĉĉĉĉĉĉ":722,"Ġld":723,"8888":724,"Ġtyp":725,"ss":726,"MAX":727,"tree":728,"->":729,"]]":730,"Ġpii":731,"Ġun":732,"em":733,"Ġmid":734,"ĠI":735,"âĸĳâĸĳ":736,"EP":737,"gor":738,"â£¿â£¿":739,"ds":740,"Ġto":741,"ĠB":742,"ithm":743,"gorithm":744,"Ġ\";":745,"âĸĪ":746,"Ġcur":747,"Ġsize":748,"Ġ?":749,"99":750,"len":751,"num":752,"all":753,"Ġfalse":754,"algorithm":755,"Ġprintf":756,"ĉĠĠ":757,"Ġsum":758,"ver":759,"pre":760,"fi":761,"ion":762,"lo":763,"Ġ#":764,"sort":765,"get":766,"]-":767,"gs":768,"fr":769,"bs":770,"Ġz":771,"Ġ'\\":772,"ent":773,"ĠINF":774,"th":775,"li":776,"ower":777,"////////":778,"mx":779,"agma":780,"pragma":781,"pop":782,"KKKKKKKK":783,"sz":784,"ES":785,"NO":786,"&&":787,"math":788,"/*":789,"Ġstdin":790,"est":791,"Ġ100000000":792,"Ġ10":793,"Ġse":794,"Ġtypename":795,"AR":796,"to":797,"Ġ5":798,"ex":799,"*(":800,"ostream":801,"Ġmem":802,"red":803,"Ġfi":804,"Ġ7":805,"++--":806,"]+":807,"vi":808,"(!":809,"----------------":810,"ub":811,"co":812,"Ġios":813,"Ġ-=":814,"Ġunsigned":815,"count":816,"Ġ(!":817,"Ġinf":818,")%":819,"++--++--":820,"ay":821,"Ġarr":822,"ound":823,"ft":824,"Ġad":825,"ULL":826,"Ġsolve":827,"Ġis":828,"input":829,"rep":830,"oint":831,"MMMM":832,"Ġ);":833,"ld":834,"ĠGC":835,"ull":836,"sk":837,"ce":838,"32":839,"\",\"":840,"date":841,")(":842,"ht":843,"ifdef":844,"break":845,"########":846,"ff":847,");}":848,"ĉĉĠĠ":849,"ĠGCC":850,"Ġpos":851,"insert":852,"ps":853,"Ġvi":854,"Ġret":855,"',":856,"Ġgcd":857,"ordered":858,"ta":859,"Ġ4":860,"ĠV":861,"mid":862,"ĠO":863,"âĸĪâĸĪ":864,"idx":865,"*/":866,"ĠLL":867,"cmath":868,"Ġ\\":869,"Ġ\"\\":870,"Ġout":871,"âĸĴ":872,"ĠMAX":873,"53":874,"vis":875,"ï¿½ï¿½ï¿½ï¿½":876,"ro":877,"Ġinline":878,"18":879,"Ġchar":880,")/":881,"\"<<":882,"ight":883,"Ġid":884,"15":885,"Ġfreopen":886,"GS":887,"Ġle":888,"stack":889,"cstdio":890,"Ġset":891,"now":892,"im":893,"and":894,"100":895,"dfs":896,"Ġ\",":897,"Ġstring":898,"Ġrep":899,"pii":900,",&":901,"Ġos":902,"Ġtree":903,"Ġstdout":904,"bug":905,"cerr":906,"art":907,"Ġclass":908,"26":909,"Ġwhile":910,"fl":911,"NULL":912,"tim":913,"YES":914,"Ġ1000000007":915,"10000":916,"________":917,"Ġstr":918,"uct":919,"es":920,"clo":921,"ĉĉĉĠ":922,"ip":923,"assert":924,"sizeof":925,"continue":926,"mem":927,"Ġcerr":928,"................":929,"ax":930,"bound":931,"EEEEEEEE":932,"Ġbool":933,"[]":934,"ĠPI":935,"Ġlen":936,"sed":937,"========":938,"ty":939,"//#":940,"(-":941,"Ġ]":942,"ĠFOR":943,"Ġmemset":944,"Ġ--":945,"Ġmx":946,">&":947,"output":948,"Ġnum":949,"'.":950,"ity":951,"Ġpll":952,"hpp":953,"ri":954,"14":955,"Ġpre":956,"ĠU":957,"Ġread":958,"...)":959,"ĠAr":960,"12":961,"@@":962,"ARGS":963,"]++;":964,"uer":965,"Ġco":966,"SE":967,"ĉĉĊ":968,"buil":969,"Ġcontinue":970,"sse":971,"tmp":972,"ment":973,"Ġpi":974,"MAXN":975,"Ġoptim":976,"Ġdfs":977,"update":978,";;;;":979,"are":980,"clock":981,"ci":982,"solve":983,"({":984,"VA":985,"cstring":986,"his":987,"order":988,"ite":989,"uery":990,"Ġ!":991,"âĸĴâĸĴ":992,"iterator":993,"Ġull":994,"OC":995,"oc":996,"ĠX":997,"edge":998,";++":999,"Ġoptimize":1000,"wap":1001,"act":1002,"///":1003,"********************************":1004,"20":1005,",,,,":1006,"stat":1007,"erase":1008,"FOR":1009,"Ġof":1010,"});":1011,"ĠĠĊ":1012,"ction":1013,"Ġ[":1014,"Ġac":1015,"empty":1016,"Ġfr":1017,"().":1018,"stdin":1019,"ĠE":1020,"Ġsq":1021,"ok":1022,"struct":1023,"verse":1024,">(":1025,"Ġsizeof":1026,"::::":1027,"abs":1028,"]){":1029,"');":1030,"Ġadd":1031,"Ġ10000":1032,"MOD":1033,"add":1034,"INE":1035,"WWWWWWWW":1036,"Ġtemp":1037,"33":1038,"mn":1039,"cle":1040,"lib":1041,">,":1042,"Ġii":1043,"ont":1044,"ult":1045,"97":1046,"ep":1047,"sion":1048,"Ġdebug":1049,"LINE":1050,"Ġss":1051,"unordered":1052,"Ġ*/":1053,"time":1054,"Ġne":1055,"GGGG":1056,"Ġthe":1057,"man":1058,"Ġ.":1059,"stdlib":1060,"Ġtmp":1061,"maxn":1062,"vec":1063,"DG":1064,"]=='":1065,"ata":1066,"âķ":1067,"Ġvalue":1068,"Ġeps":1069,"DDDDDDDD":1070,"front":1071,"dist":1072,"','.":1073,"cision":1074,"Ġand":1075,"Ġ*=":1076,"1000":1077,"bitset":1078,"find":1079,"Ġarg":1080,"<<'":1081,"Ġ%=":1082,"Int":1083,")-":1084,"<<(":1085,"precision":1086,"gcd":1087,"24":1088,")+":1089,"WWW":1090,"Ġnode":1091,"Ġmul":1092,"////////////////":1093,"ioman":1094,"iomanip":1095,"88888888":1096,"comp":1097,"]={":1098,"Ġ(\"":1099,">;":1100,"adj":1101,"az":1102,"Ġup":1103,"REP":1104,"(...)":1105,"Ġend":1106,"fast":1107,"âĸĢ":1108,"âł":1109,"Ġ^":1110,"(__":1111,"Ġabs":1112,"++--++--++--++--":1113,"this":1114,"58":1115,"par":1116,"ange":1117,"gth":1118,"Ġbreak":1119,"Ġacos":1120,"ab":1121,"stdout":1122,"Ġ1000":1123,"ec":1124,"top":1125,"(_":1126,"â£¿â£¿â£¿â£¿":1127,"Ġmap":1128,"In":1129,"Ġ\"<<#":1130,"unction":1131,"resize":1132,"Ġinclude":1133,"Ġsort":1134,"EEE":1135,"JU":1136,")*":1137,"one":1138,"memset":1139,"ER":1140,"<<\"\\":1141,"ĉĉĉĠĠ":1142,"rix":1143,"name":1144,"AL":1145,"DGE":1146,"JUDGE":1147,"mask":1148,"xx":1149,"NLINE":1150,"<(":1151,"pper":1152,"ptr":1153,"builtin":1154,"ne":1155,"EB":1156,"159":1157,"rand":1158,"Ġ6":1159,"Ġ';":1160,"cstdlib":1161,"its":1162,"Ġdefine":1163,")*(":1164,"arent":1165,"14159":1166,"||":1167,"1415926":1168,"rr":1169,"Ġdb":1170,")<<":1171,"Ġ/=":1172,"--){":1173,"clear":1174,"dex":1175,"list":1176,"Ġostream":1177,"ndef":1178,"lace":1179,"Ġdist":1180,"last":1181,"KKK":1182,"Max":1183,"Ġlo":1184,"col":1185,"â¢":1186,"heck":1187,"','.','.":1188,"ST":1189,"deque":1190,"IO":1191,"rite":1192,"gnu":1193,"Ġcom":1194,"43":1195,"args":1196,"ĠONLINE":1197,"âĸĦ":1198,"Ġbu":1199,"à¦":1200,"ifndef":1201,"âĸĳâĸĳâĸĳâĸĳ":1202,"tag":1203,"ash":1204,"rbegin":1205,"di":1206,"iner":1207,"Ġbase":1208,"true":1209,"ĠH":1210,"]!=":1211,"used":1212,"EPS":1213,"tainer":1214,"Ġmn":1215,"22":1216,"141592653":1217,"swap":1218,"puts":1219,"cc":1220,"ĠMAXN":1221,"ore":1222,">::":1223,"('":1224,"Ġdx":1225,"37":1226,"xed":1227,"Ġĉ":1228,"length":1229,"sstream":1230,"Ġdy":1231,"},":1232,"30":1233,"MMMMMMMM":1234,"Ġcheck":1235,"ior":1236,"tot":1237,"Ġput":1238,"Ġlast":1239,"50":1240,"atrix":1241,"]*":1242,"ha":1243,"ctime":1244,"azy":1245,"lex":1246,"lli":1247,"dd":1248,"hs":1249,"ĠREP":1250,"Ġhe":1251,"value":1252,"OCAL":1253,"SEC":1254,"iority":1255,"UG":1256,"istream":1257,"Ġfind":1258,"tt":1259,"function":1260,"pow":1261,"Ġok":1262,"Ġvv":1263,"make":1264,"Ġex":1265,"Ġquery":1266,"Ġ){":1267,"<<\":":1268,"pbds":1269,"Ġsc":1270,"Ġlc":1271,"-=":1272,"Ġvec":1273,"aa":1274,"55":1275,"################":1276,"pll":1277,"AC":1278,"null":1279,"(),(":1280,"Ġvis":1281,"read":1282,"Ġff":1283,"container":1284,"Ġcomp":1285,"ĠY":1286,"Ġidx":1287,"low":1288,"/=":1289,"ink":1290,"root":1291,"00005":1292,"Ġpar":1293,"Ġdi":1294,"alc":1295,"ics":1296,"left":1297,"pl":1298,"uti":1299,"chr":1300,"ĠK":1301,"Ġhi":1302,"Ġ100":1303,"ĉĉĉĉĉĉĉ":1304,"seg":1305,"LE":1306,"istics":1307,"EBUG":1308,"ber":1309,"av":1310,"pol":1311,"sub":1312,"operator":1313,"arget":1314,"statistics":1315,"Ġ++)":1316,"assoc":1317,"prime":1318,"ĠLOCAL":1319,"Ġbit":1320,"Ġadj":1321,"cassert":1322,"ono":1323,"row":1324,"ĠEPS":1325,"Ġsi":1326,":.":1327,"Ġgo":1328,"Ġen":1329,"Ġ9":1330,"go":1331,"ation":1332,"...);":1333,"â¡":1334,"ĠArgs":1335,"pt":1336,"<<\"=":1337,"ead":1338,"16":1339,"next":1340,"]-'":1341,"KKKKK":1342,"Ġfast":1343,"__)":1344,"Ġauto":1345,"38":1346,"inf":1347,"Ġ{}":1348,"emplace":1349,"gh":1350,"popcount":1351,"Ġargs":1352,"oo":1353,"Ġï¿½ï¿½ï¿½ï¿½":1354,"mul":1355,"<<#":1356,"998":1357,"=-":1358,"Ġmaxn":1359,"ĠIn":1360,"ĠArg":1361,"14159265358":1362,"It":1363,"Ġ\":":1364,"Ġnow":1365,"rend":1366,"polic":1367,"=='":1368,"mt":1369,"46":1370,"Ġtarget":1371,"<<\"=\"<<":1372,"Ġtot":1373,"flag":1374,"che":1375,"Ġprint":1376,"lim":1377,"ME":1378,"Ġ()":1379,"Ġgetchar":1380,"inv":1381,"Ġpower":1382,"]+=":1383,"ng":1384,"Ġvll":1385,"Ġsh":1386,"eric":1387,"]));":1388,"ive":1389,"Ġstart":1390,"Ġsqr":1391,"1415926535897":1392,"99824":1393,"31":1394,"Size":1395,"56":1396,"functional":1397,"lic":1398,"nxt":1399,"================":1400,"9982443":1401,"RE":1402,"point":1403,"ary":1404,"14159265358979":1405,"998244353":1406,"ype":1407,"()-":1408,")))":1409,"policy":1410,"wer":1411,"Ġnxt":1412,"reverse":1413,"1111":1414,"iff":1415,"Ġcount":1416,"Ġright":1417,"Ġbe":1418,"34":1419,"@@@@":1420,"ĉĉĉĉĠ":1421,"]];":1422,"<<\"=\"<<(":1423,"expr":1424,"Ġleft":1425,"lf":1426,"Ġless":1427,"fact":1428,"typeof":1429,"Ġpoint":1430,"hild":1431,"Ġprime":1432,"Ġ->":1433,"check":1434,"Ġnext":1435,"ero":1436,"Ġnull":1437,"right":1438,"Ġlower":1439,"start":1440,"Ġcol":1441,"Ġscan":1442,"Ġtype":1443,"]].":1444,"ĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉ":1445,"Ġ};":1446,"Ġfl":1447,"Ġvii":1448,"ĠSZ":1449,"--------------------------------":1450,"Matrix":1451,"UT":1452,"Ġpow":1453,"Ġnew":1454,"ublic":1455,"gr":1456,"oot":1457,"Ġyou":1458,"sc":1459,"ĠĠĠĊ":1460,"INT":1461,"chrono":1462,"qu":1463,"Ġrb":1464,"ique":1465,"[]={":1466,"Ġ>>=":1467,"data":1468,"ĠW":1469,"dis":1470,"pi":1471,"com":1472,"no":1473,"numeric":1474,"-'":1475,"100000000":1476,"ath":1477,"(\"-":1478,"]>":1479,"77":1480,"KKKKKKKKKKKKKKKK":1481,"199":1482,"Ġfrom":1483,"fstream":1484,"Ġpop":1485,"RT":1486,"FF":1487,"II":1488,"Node":1489,"Ġth":1490,"âĸĪâĸĪâĸĪâĸĪ":1491,"ĉĉĉĊ":1492,"]<<\"":1493,"1415926535897932":1494,"link":1495,"ater":1496,"Ġsp":1497,"+(":1498,"ĠQ":1499,"Ġtest":1500,",;":1501,"]--;":1502,"public":1503,"]))":1504,"ob":1505,"Ġfixed":1506,"(*":1507,"Ġind":1508,"Mod":1509,"Ġpf":1510,"sq":1511,"init":1512,"Ġor":1513,"Ġmy":1514,"aph":1515,"test":1516,"su":1517,"nullptr":1518,"bb":1519,"mi":1520,"uple":1521,"lement":1522,"%=":1523,"orm":1524,"ark":1525,"ove":1526,"main":1527,"ular":1528,"Ġgr":1529,"loop":1530,"reater":1531,"Ġas":1532,"ns":1533,"static":1534,"Ġinit":1535,"01":1536,"Ġcl":1537,"lazy":1538,"uint":1539,")){":1540,"rem":1541,"ĉĉĉĉĉĉĉĉĉĉĉĉ":1542,"ail":1543,"Point":1544,"Ġon":1545,"Ġseg":1546,"Ġtrace":1547,"Ġmask":1548,"141592653589793238":1549,"Ġparent":1550,"Ġfact":1551,"Ġroot":1552,"200":1553,"exp":1554,"]<":1555,"edges":1556,"PER":1557,"Ġpriority":1558,"MP":1559,"vv":1560,"ros":1561,"Ġsqrt":1562,"Ġlcm":1563,"Ġusing":1564,"Ġsub":1565,"forn":1566,"+=(":1567,"dge":1568,",(":1569,"RO":1570,"dig":1571,"19937":1572,"oth":1573,"write":1574,",+":1575,"Ġinv":1576,"build":1577,"-(":1578,"(\"\\":1579,"Ġĉĉ":1580,"pth":1581,"per":1582,"IT":1583,"curr":1584,"OCK":1585,"LOCK":1586,"cost":1587,"Ġresult":1588,"()){":1589,"*=":1590,"14159265358979323846":1591,"No":1592,"Ġ998244353":1593,"Ġ::":1594,"pa":1595,"yy":1596,"Ġvvi":1597,"Ġat":1598,"]][":1599,"sin":1600,"unique":1601,"Ġsetprecision":1602,"Ġ31":1603,"________________":1604,"ĠMod":1605,"Ġmd":1606,"mark":1607,"Ġ8":1608,"Ġswap":1609,"âĸĴâĸĴâĸĴâĸĴ":1610,"ho":1611,"query":1612,"'){":1613,"ILE":1614,"getchar":1615,"lock":1616,"100005":1617,"ah":1618,"++--++--++--++--++--++--++--++--":1619,"MX":1620,"ON":1621,"âĸĢâĸĢ":1622,"Ġ20":1623,"LOCKS":1624,"[(":1625,"79":1626,"48":1627,"Ġupper":1628,"sol":1629,"able":1630,"00000":1631,"lower":1632,"iii":1633,"~~":1634,"Ġordered":1635,"]=(":1636,"fix":1637,"Ġ...":1638,"ĠALL":1639,"Ġrem":1640,"index":1641,"Ġupdate":1642,"sh":1643,"******":1644,"Ġpa":1645,"]]++;":1646,"&(":1647,"Ġcan":1648,"from":1649,"19":1650,"Ġbegin":1651,"Ġclock":1652,"eger":1653,"ĠIO":1654,"vl":1655,"Val":1656,"ited":1657,"Ġms":1658,"ĠDEBUG":1659,"ie":1660,"Ġ'<<":1661,"hash":1662,"tion":1663,"Ġcomment":1664,"Ġputs":1665,"500":1666,"jj":1667,"lc":1668,"Ġ),":1669,"complex":1670,"avx":1671,"Ġsol":1672,"constexpr":1673,"odd":1674,"Ġcost":1675,"DE":1676,"17":1677,"lity":1678,"WK":1679,"Ġsy":1680,",_":1681,"har":1682,")<<\",":1683,"Ġvs":1684,")));":1685,"req":1686,"be":1687,"ev":1688,"do":1689,"stringstream":1690,"ang":1691,"och":1692,"random":1693,"new":1694,"/**":1695,"ory":1696,"Ġlow":1697,"Ofast":1698,"linker":1699,"Ġforn":1700,"ĉĉĉĉĉĉĉĉĉĉĉĉĉ":1701,");++":1702,"Ġxx":1703,"tiset":1704,"):":1705,"ative":1706,"epoch":1707,"since":1708,"Ġ\"/":1709,"Ġdis":1710,"]),":1711,"db":1712,"////////////////////////////////":1713,"23":1714,"-')":1715,"GGGGGGGG":1716,"ms":1717,"parent":1718,"array":1719,"pq":1720,"arg":1721,"wo":1722,"Time":1723,"Ġ(((":1724,"ach":1725,"ost":1726,"ild":1727,"heap":1728,"100000":1729,"++]":1730,"Ġpt":1731,"Ġbin":1732,"Ġused":1733,"MatrixSize":1734,"vs":1735,"utility":1736,"Ġuint":1737,"buf":1738,"Ġsu":1739,">>(":1740,"]])":1741,"acro":1742,"Ġ100000":1743,"unsigned":1744,"our":1745,"ill":1746,"substr":1747,"),(":1748,"Ġ^=":1749,"59":1750,"28":1751,"Ġrall":1752,"Iterator":1753,"te":1754,"stead":1755,"own":1756,"MaxMatrixSize":1757,"âĸĮ":1758,"Pos":1759,"best":1760,"Ġiter":1761,"file":1762,"AS":1763,"Ġ++;":1764,"Ġpq":1765,"atch":1766,"ave":1767,"vel":1768,"Ġerr":1769,"print":1770,".....":1771,"27":1772,"Ġpp":1773,"Ġcmp":1774,"Ġdbg":1775,"Ġflag":1776,"Ġ\")":1777,"Ġoo":1778,"result":1779,"sim":1780,"Ġ30":1781,"calc":1782,"60":1783,"___":1784,"Ġtime":1785,"Ġlb":1786,"names":1787,"Ġrhs":1788,"++,":1789,"TES":1790,"Ġpw":1791,"Ġno":1792,"Ġwrite":1793,"exit":1794,"less":1795,"ross":1796,"AT":1797,"Char":1798,"Ġ26":1799,"','.','.','.','.":1800,"Ġtm":1801,"9999":1802,"__,":1803,"ly":1804,"ance":1805,"power":1806,"âķĲ":1807,"steady":1808,"Ġ\"]":1809,"Count":1810,"Ġrng":1811,"................................":1812,")==":1813,"Ġcalc":1814,"Tree":1815,"erge":1816,"Ġneed":1817,"29":1818,"Ġvl":1819,"ord":1820,"Ġ'.":1821,"key":1822,"memory":1823,"Ġyy":1824,"------":1825,"Ġsf":1826,"Ġbuild":1827,"Case":1828,"CRT":1829,"Ġver":1830,"Edge":1831,"Ġemplace":1832,"URE":1833,"ĠInt":1834,"hor":1835,"###":1836,"13":1837,"KKKKKKK":1838,"Yes":1839,"Ġtl":1840,"Ġ(*":1841,"','":1842,"ays":1843,"omp":1844,"SECURE":1845,"tex":1846,"Ġaa":1847,"ĠMP":1848,"\".":1849,";.":1850,"ĠPB":1851,"Ġdo":1852,"iv":1853,"200005":1854,"ust":1855,"high":1856,"br":1857,"ĠPII":1858,"tuple":1859,"ĠMax":1860,"Ġke":1861,"sqrt":1862,"nx":1863,"Type":1864,"md":1865,"rime":1866,"prev":1867,"AN":1868,"Ġistream":1869,"ALL":1870,"element":1871,"ice":1872,"Out":1873,"]]=":1874,"iiii":1875,"<=(":1876,">>=":1877,"tf":1878,"loat":1879,"loops":1880,"(;":1881,"ĠDB":1882,"Ġprev":1883,"Ġtemplate":1884,"Ġnorm":1885,"Ġinput":1886,"################################":1887,"))%":1888,"1000000007":1889,"âĸĦâĸĦ":1890,"DEBUG":1891,"Ġindex":1892,"Ġgc":1893,"},{":1894,"%%":1895,"diff":1896,"Ġ\"[":1897,"Ġby":1898,"Min":1899,"digit":1900,"Ġtt":1901,"debug":1902,"popcnt":1903,"upd":1904,"ard":1905,"SZ":1906,"tl":1907,"âĶ":1908,"();}":1909,"Ġmt":1910,"ter":1911,"OF":1912,"ĉĉĉĉĉĠ":1913,"roll":1914,"Ġ',":1915,"Ġdata":1916,"/********************************":1917,"FILE":1918,"Ġthis":1919,"Ġmk":1920,"flow":1921,"use":1922,")),":1923,"1010":1924,"Ġreverse":1925,"Ġ|=":1926,"DDD":1927,"cr":1928,"mmx":1929,"ĠMX":1930,"deg":1931,"Ġbest":1932,"ssse":1933,"Ġinsert":1934,";;;;;;;;":1935,"Arr":1936,"unroll":1937,"ĉĉĉĉĠĠ":1938,"Ġ(;":1939,"FS":1940,"Ġli":1941,"Ġrange":1942,"abm":1943,"IZ":1944,"ift":1945,"GGG":1946,"âĶĢ":1947,"mm":1948,"KE":1949,"40":1950,"\\\\":1951,"ank":1952,",,,,,,,,":1953,"arch":1954,"mall":1955,"Ġbig":1956,"âķ¬":1957,"pref":1958,"8888888888888888":1959,"ls":1960,"])%":1961,"DDDDDDDDDDDD":1962,"57":1963,"]%":1964,"NIN":1965,"WAR":1966,"St":1967,"Ġfin":1968,"po":1969,"rk":1970,"Ġdel":1971,"WARNIN":1972,"Integer":1973,"other":1974,"Ġarray":1975,"WARNINGS":1976,"]<<":1977,"TT":1978,"clim":1979,"answer":1980,"une":1981,"Ġbuf":1982,"priority":1983,"ĠPoint":1984,"big":1985,"der":1986,"ution":1987,"WWWWWWW":1988,"climits":1989,"Line":1990,">=(":1991,"Ġrev":1992,"Ġpref":1993,"Ġrr":1994,")?":1995,"]>=":1996,"Ġcc":1997,"Ġrand":1998,"=\"":1999,"upper":2000,"uthor":2001,"OUT":2002,"sible":2003,"Ġub":2004,"limits":2005,"ra":2006,"Ġnot":2007,"ĠFI":2008,"fixed":2009,"dx":2010,"fa":2011,"by":2012,"maxN":2013,"setprecision":2014,"AST":2015,"3456":2016,"MMMMMMMMMMMMMMMM":2017,"IZE":2018,"!!":2019,"Ġputchar":2020,"à§":2021,"Ġmi":2022,"fac":2023,"Ġ');":2024,"WWWWWW":2025,"EEEEEEEEEEEE":2026,"**************":2027,"fill":2028,"Ġline":2029,"throw":2030,"maxi":2031,"â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿":2032,"Ġnames":2033,"For":2034,"visited":2035,"native":2036,"Ġ\"\";":2037,"'\\":2038,"â£¿â£":2039,"tune":2040,":::":2041,"EC":2042,"Ġnumber":2043,"://":2044,"onent":2045,"rc":2046,"rb":2047,"21":2048,"]<=":2049,"Ġps":2050,"Ġfile":2051,"NN":2052,"ĉĠĊ":2053,"Ġiterator":2054,"\"\"":2055,"KKKKKK":2056,"Ġ.,;":2057,"Ġ{-":2058,"âĸĲ":2059,"00010":2060,"ln":2061,"cy":2062,"*-":2063,"NU":2064,"Ġ32":2065,"<<'\\":2066,"Ġ(__":2067,"Ġfore":2068,"head":2069,"fj":2070,"ctype":2071,"Ġ(\"%":2072,"ĠIOS":2073,"âķ¬âķ¬":2074,"Ġque":2075,"iter":2076,"ĠCLOCKS":2077,"Ġ100005":2078,"Ġbs":2079,"ĠĠĠĉ":2080,"ION":2081,"Ġev":2082,"ET":2083,"Ġĉĉĉ":2084,"ACK":2085,"ik":2086,"25":2087,"rev":2088,"namespace":2089,"child":2090,"264":2091,"Ġ-*-":2092,"obj":2093,",\"":2094,"â¢Ģ":2095,"101":2096,"111":2097,"89":2098,"Ġrow":2099,"Ġcomma":2100,"ONG":2101,"()))":2102,"Ġone":2103,"ĠINT":2104,"rs":2105,"Ġare":2106,"Ġpc":2107,"Ġdeb":2108,"pw":2109,"Ġdiff":2110,"kk":2111,"']":2112,"ask":2113,";--":2114,"OG":2115,"rint":2116,"iz":2117,"Ġ\"%":2118,"47":2119,"Ġï¿½ï¿½ï¿½ï¿½ï¿½ï¿½":2120,"onoid":2121,"sm":2122,"(\"\");":2123,",.":2124,"Ġneg":2125,"pro":2126,"STACK":2127,"ry":2128,"Ġedge":2129,"flush":2130,"PB":2131,"Ġ/*":2132,"Ġcurr":2133,"my":2134,"<<-":2135,"105":2136,"Ġ\"(\"":2137,"Ġ1000000000":2138,"Long":2139,"000000":2140,"Ġanswer":2141,"!=(":2142,"Ġzero":2143,"Ġ'-')":2144,"enter":2145,"'s":2146,"Ġrt":2147,"Ġgreater":2148,"Ġwith":2149,"Ġper":2150,"));}":2151,"log":2152,"14159265358979323846264":2153,"WKK":2154,"Ġta":2155,"Ġbb":2156,"color":2157,"Ġmark":2158,"Ġdepth":2159,"Ġsync":2160,"Ġal":2161,"multiset":2162,"dep":2163,"âĸĵ":2164,"49":2165,"Range":2166,"ĠVI":2167,"AME":2168,"acos":2169,"neg":2170,"'||":2171,"PII":2172,"putchar":2173,"Value":2174,"ud":2175,"ĠInput":2176,"Vector":2177,"@@@@@@@@":2178,"fin":2179,"Ġrd":2180,"--,":2181,"Ġsign":2182,"uff":2183,"Ġel":2184,"Ġhash":2185,"Input":2186,"['":2187,"}}":2188,"Ġexp":2189,"popcountll":2190,"DEEEE":2191,"(#":2192,"ara":2193,"ux":2194,"Ġnormal":2195,"Ġprimes":2196,"del":2197,"Ġwh":2198,"rg":2199,"(\"%.":2200,"action":2201,"Ġhell":2202,"67":2203,")]":2204,"ĠZ":2205,"[](":2206,"_|":2207,"oost":2208,"#####":2209,"Ġexit":2210,"we":2211,"Ġscani":2212,")&":2213,")<<\"":2214,"Ġlim":2215,"Ġlli":2216,",:":2217,"ND":2218,"Ġhigh":2219,"bad":2220,"Ans":2221,"]='":2222,"]],":2223,"greater":2224,"here":2225,"Ġstruct":2226,"ain":2227,"bl":2228,"1415926535897932384626433":2229,"depth":2230,"ded":2231,"Ġ\"-":2232,"WWWWWWWWW":2233,"itr":2234,"Ġgen":2235,"af":2236,"case":2237,"old":2238,"Ġà¦":2239,"Ġwe":2240,"Ġ///":2241,"Ġcomplex":2242,"_(":2243,"cp":2244,"Ġtotal":2245,"tc":2246,"ire":2247,"total":2248,"need":2249,"ĠĠĉ":2250,"ĉĉĉĉĉĉĉĉĉ":2251,"ope":2252,"ĠPR":2253,"Str":2254,"Ġlazy":2255,"Ġmacro":2256,"ai":2257,"......":2258,"Ġeb":2259,"fri":2260,"**/":2261,"âłĢ":2262,"âĶĢâĶĢ":2263,"OW":2264,"tm":2265,"umber":2266,"aken":2267,"80":2268,"Ġoutput":2269,"Ġupd":2270,"Ġfill":2271,"friend":2272,"NAME":2273,"was":2274,"blem":2275,"ces":2276,"PI":2277,"ĉĉĉĉĉĉĉĠĠ":2278,"ant":2279,"__;":2280,"ition":2281,"ED":2282,"ĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉ":2283,"De":2284,"âĸĳâĸĳâĸĳ":2285,"****************************************************************":2286,"derr":2287,"Ġvpii":2288,"123":2289,"path":2290,"Ġmodular":2291,"ĉĉĉĉĊ":2292,"000000000":2293,"();++":2294,"Ġï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½":2295,"Ġstat":2296,")((":2297,"LI":2298,"Ġedges":2299,"/(":2300,"Ġ~":2301,"rent":2302,"ĠJ":2303,"()),":2304,"NOTES":2305,"Ġmat":2306,"qual":2307,"cept":2308,"Ġmulti":2309,"CT":2310,"54":2311,"âķĲâķ":2312,"&...":2313,"()==":2314,"ump":2315,"Ġ11":2316,"::::::::":2317,"VI":2318,"Ġme":2319,"}\";":2320,")<<\"\\":2321,"Le":2322,"arry":2323,"mag":2324,"dy":2325,"isdigit":2326,"34567":2327,"ial":2328,"]]);":2329,"cctype":2330,"Ġ')":2331,"Ġgraph":2332,"dbg":2333,"ies":2334,"ACRO":2335,"Iter":2336,"freq":2337,",,,":2338,"Ġ\"]\";":2339,"UN":2340,"float":2341,"888":2342,"cum":2343,"ĉĉĉĉĉĉĠĠ":2344,"Ġhtt":2345,"66":2346,"14159265358979323846264338":2347,"rest":2348,"ors":2349,"ny":2350,"Ġother":2351,"tail":2352,"texs":2353,"ĠÐ":2354,"ĠSQ":2355,"hite":2356,"Ġ][":2357,"Ġpdd":2358,"TS":2359,"fore":2360,"â¢¿":2361,"Ġ>::":2362,")>>":2363,"ĠPT":2364,"Ġsec":2365,"nod":2366,"Ġclr":2367,"Ġ\"[\";":2368,"ĠPrint":2369,"1005":2370,"wt":2371,"ute":2372,"Ġrnd":2373,"state":2374,";;;":2375,"ĠLINF":2376,"ks":2377,"Ġnl":2378,"Ġcross":2379,"disp":2380,"ww":2381,"Ġ];":2382,"mon":2383,"srand":2384,"bj":2385,"clz":2386,"........................":2387,"nn":2388,"Ġshift":2389,"Ġext":2390,"search":2391,"Ġmodul":2392,")<":2393,"unc":2394,"ear":2395,"39":2396,"vll":2397,"[++":2398,"Ġ12":2399,"lst":2400,"suf":2401,"Child":2402,"Ġpro":2403,"--------------":2404,"cap":2405,"df":2406,"EK":2407,"Ġorder":2408,"Ġodd":2409,"WWWWW":2410,"cmp":2411,"Ġ&_":2412,"Ġunordered":2413,"EM":2414,"Ġassert":2415,"Ġbinary":2416,"son":2417,"level":2418,"Ġhead":2419,"Ġkey":2420,"Ġvc":2421,"Ġfabs":2422,"68":2423,"cpp":2424,"ĉĉĉĉĉĉĠ":2425,"Ġsm":2426,"61":2427,"Prime":2428,"Ġ\")\";":2429,"XX":2430,"Ġbound":2431,"ivate":2432,"0000000000":2433,"âĸĳâĸĳâĸĳâĸĳâĸĳâĸĳâĸĳâĸĳ":2434,"raction":2435,"1000000":2436,"Sum":2437,"mini":2438,"Ġfn":2439,"100010":2440,"ĉĉĉĉĉĉĉĉĉĉĉ":2441,"1415926535897932384626433832":2442,"Ġ.:":2443,")+(":2444,"Ġstatic":2445,"==-":2446,"================================":2447,"jk":2448,"imer":2449,"atcher":2450,"range":2451,"Ġmaxi":2452,"ĉĉĉĉĉĉĉĉĉĉ":2453,"primes":2454,"dispatcher":2455,"Ġcont":2456,"Ġmerge":2457,"graph":2458,"ASE":2459,"Ġpl":2460,"tp":2461,"cs":2462,"zero":2463,"ĉĉĉĉĉĉĉĠ":2464,"&]":2465,"Ġvar":2466,"(#__":2467,"Ġthat":2468,"Ġ`":2469,"eld":2470,"Ġ<<\"":2471,"iple":2472,"EEEEEEEEEEEEEEEE":2473,"20000":2474,"Ġtop":2475,"Ġdig":2476,"ASK":2477,"ĠFor":2478,"Ġ(_":2479,"Ġchk":2480,"Ġ\"{":2481,"side":2482,"assign":2483,"ource":2484,"eve":2485,"cess":2486,"CLOCKS":2487,"dq":2488,"ĠLD":2489,"ĠComp":2490,"Ġ].":2491,"Ġ--------------------------------":2492,"Ġcase":2493,"ulate":2494,"Ġct":2495,"good":2496,"tu":2497,"pha":2498,"Ġtc":2499,"erse":2500,"private":2501,"ĠNULL":2502,";}}":2503,"Ġri":2504,"ĠMin":2505,"1001":2506,"sec":2507,"Ġ1000000":2508,"++--++--++--++--++--++--++--++--++--++--++--++--++--++--++--++--":2509,"ĠDBN":2510,"Ġtypedef":2511,"IME":2512,"Ġloc":2513,"ba":2514,"down":2515,"Ġbr":2516,"Ġ200":2517,"*****":2518,"Con":2519,"ðŁ":2520,"()+":2521,"Ġdep":2522,"GGGDDDDDDDDDDDD":2523,"141592653589793238462643383279":2524,";:":2525,"Ġnx":2526,"Ġtuple":2527,"Ġdeg":2528,"comma":2529,"************************":2530,"Ġ50":2531,"Ġstrlen":2532,"LG":2533,"Ðµ":2534,");(":2535,"core":2536,"stdinPos":2537,"300":2538,"69":2539,"Ġ15":2540,"Ġobj":2541,"âłĢâłĢ":2542,"ĠOO":2543,"Array":2544,"ĠNode":2545,"Ġoff":2546,"]:":2547,"Ġmodint":2548,"ĠLOG":2549,"[],":2550,"Ġitr":2551,"Ġvb":2552,"cltype":2553,"Ġargc":2554,"'t":2555,"eps":2556,"opy":2557,"),&(":2558,"'&&":2559,"anc":2560,"Ġcode":2561,"stem":2562,"IL":2563,"Ġpath":2564,"ĠPLL":2565,"Ġlog":2566,"ish":2567,"CH":2568,"scan":2569,"Ġtp":2570,"ĠDI":2571,"stderr":2572,"NUM":2573,")++)":2574,"Ð¾":2575,"Ġnd":2576,"Ġsd":2577,"\",(":2578,"&&(":2579,"bo":2580,"Ġ[&]":2581,"AA":2582,"AD":2583,"Ġvpll":2584,"irection":2585,"Imp":2586,"ĠMEM":2587,"ser":2588,"IOS":2589,"egment":2590,"ew":2591,"++++":2592,"Ġtwo":2593,"Ġfac":2594,"Ġloop":2595,"$$":2596,"KKKKKKKKKK":2597,"EEEEEEEEEEE":2598,"dir":2599,"ĠGet":2600,"07":2601,"cast":2602,"number":2603,"ĠTR":2604,"41":2605,"reg":2606,"Ġhave":2607,"3333":2608,"[{":2609,"rd":2610,")[":2611,"msk":2612,"09":2613,"63":2614,"ĠĠĠĉĉ":2615,"macro":2616,"ork":2617,"ui":2618,"]>>":2619,"dif":2620,"Ġmult":2621,"Ġerror":2622,"MIN":2623,"Ġed":2624,"ä¸":2625,"inp":2626,"fo":2627,"Ġhere":2628,"Ġsuf":2629,"Ġeven":2630,"real":2631,"Ġbfs":2632,"]=-":2633,"ĉĠĠĊ":2634,"ĠEOF":2635,"â¡¿":2636,"lint":2637,"Ġlst":2638,"EED":2639,"Ġ----------------":2640,"llah":2641,"Ġtriple":2642,"Ġwas":2643,"Ġlevel":2644,"Ġï¿½ï¿½ï¿½ï¿½ï¿½":2645,"44":2646,"block":2647,"128":2648,"fst":2649,"two":2650,"Ġ\".":2651,"KW":2652,"LGG":2653,".:":2654,"sa":2655,"Ġ\"<<(":2656,"'+":2657,"ĠTail":2658,"87":2659,"Set":2660,"even":2661,"<='":2662,"ĠmaxN":2663,"Ġlg":2664,".......":2665,"Ġmultiset":2666,"small":2667,"Ex":2668,"Power":2669,"Ġiii":2670,"matrix":2671,"CTION":2672,"Ġfst":2673,"Ġ!(":2674,"[])":2675,"Ġlength":2676,"Ġ200005":2677,"11111111":2678,"51":2679,"Ġ19":2680,"Ġgood":2681,"Ġcy":2682,"â£¯":2683,"sl":2684,"Ġ++){":2685,"ere":2686,"Ġ});":2687,"ĠMIN":2688,"ister":2689,"âĸĪâĸĪâķ":2690,"[\"":2691,"ij":2692,"Ġfa":2693,"Ġbounds":2694,"ated":2695,"Ġdelta":2696,"ĠFAST":2697,"cross":2698,"done":2699,"Ġdd":2700,"Ġ___":2701,"qr":2702,"buff":2703,"Ġhttps":2704,"bin":2705,"Ġ'.')":2706,"'},{":2707,"]-=":2708,"-=(":2709,"_,":2710,"}};":2711,"))/":2712,"Ġ500":2713,"ĠULL":2714,"...);}":2715,"â£·":2716,"â£Ł":2717,"lush":2718,"Ġĉĉĉĉ":2719,"Ġwill":2720,"ĠLong":2721,"ĠVA":2722,"EEK":2723,"fjt":2724,"ization":2725,"Comp":2726,"Ġab":2727,"SIZE":2728,"eed":2729,"&&...":2730,"Ġyour":2731,"()(":2732,"\",&(":2733,"hitespace":2734,"mo":2735,"ï¿½ï¿½ï¿½":2736,"close":2737,"Ġsin":2738,"MN":2739,"^=":2740,"200000000":2741,"ply":2742,"Monoid":2743,"nb":2744,"Ġso":2745,"\";}":2746,"Ġqr":2747,">());":2748,"Ġ(-":2749,"+'":2750,"qq":2751,"step":2752,"()->":2753,"DEF":2754,"Mul":2755,"Ġnodes":2756,"Ġpd":2757,"lb":2758,"Ġ17":2759,"Ġchild":2760,"Ġ\");":2761,"elper":2762,"Ġ60":2763,"]/":2764,"Ġ{{":2765,"uf":2766,"Ġ123":2767,"Ġppb":2768,"Ġmini":2769,"]=='.":2770,"have":2771,"ĠDirection":2772,"perm":2773,"Ġdec":2774,"à§ĩ":2775,"Ġ16":2776,"ify":2777,"ĠMACRO":2778,"valc":2779,"ãĢ":2780,"rec":2781,")>":2782,"[*":2783,"()<<":2784,"Ġara":2785,"ĠRE":2786,"____________":2787,"()>":2788,"Ġrank":2789,"Ġrest":2790,"Ġargv":2791,"Ġ',');":2792,")=(":2793,"110":2794,"Ġny":2795,"va":2796,"Ġptr":2797,"Ġrec":2798,"////////////////////////////////////////////////////////////////":2799,"trie":2800,"Ġtake":2801,"rit":2802,"uck":2803,"}*/":2804,"inc":2805,"register":2806,"WKKKKK":2807,"Ġqu":2808,"jji":2809,"ï¼":2810,"ĠRA":2811,"100100":2812,"Ġnargs":2813,"sent":2814,"Ġvp":2815,"Scan":2816,")];":2817,"ile":2818,"ĠIN":2819,"Ġelement":2820,"Ġsep":2821,"VEC":2822,"kol":2823,"Ġuse":2824,"PP":2825,"âĸĪâĸĪâĸĪ":2826,"locked":2827,"Ġmemo":2828,"table":2829,"nk":2830,"ostringstream":2831,"Ġfunction":2832,"ĠAuthor":2833,"Ġqueue":2834,"2000":2835,"lvl":2836,"Ġfx":2837,"Re":2838,"orary":2839,"Ġsk":2840,"vert":2841,"Cnt":2842,"OL":2843,"FFFF":2844,"UNCTION":2845,")=":2846,"!=-":2847,"Ġvisited":2848,">();":2849,"Ġ>(":2850,"nce":2851,"vals":2852,"Ġpo":2853,"=((":2854,"exponent":2855,"IM":2856,"ossible":2857,"ĠTT":2858,"Ġreset":2859,"Ġlca":2860,"merge":2861,"<<*":2862,"5555":2863,"Ġ--)":2864,"Ġ--;":2865,"Ġ*(":2866,"ĠFILE":2867,"ĠUn":2868,"Ġspl":2869,"bfs":2870,"Number":2871,"DB":2872,"]&&":2873,"lg":2874,"---":2875,"Ġfo":2876,"loc":2877,"End":2878,"form":2879,"Test":2880,"Ġ[&](":2881,"USE":2882,"olution":2883,"Ġost":2884,"Ġcolor":2885,"Ġce":2886,"ĉĠĉ":2887,"Ġstep":2888,"Ġvalues":2889,"SS":2890,"Ġdif":2891,":\"":2892,"var":2893,"}//":2894,"Ġinc":2895,"Start":2896,"Bit":2897,"Ġris":2898,"Ġ'?":2899,"â£¿â¡":2900,"Pow":2901,"Ġhas":2902,"]==-":2903,"Ġ&=":2904,"String":2905,"ĉĠĠĠĊ":2906,"raph":2907,"store":2908,"Ġvd":2909,"altu":2910,"Ð°":2911,"Ġsgn":2912,"ick":2913,"ĠgetChar":2914,"fflush":2915,"ĠModular":2916,"']++;":2917,"]!=-":2918,"ward":2919,"Ġln":2920,"0000000":2921,"Ġforr":2922,"oi":2923,"Ġbigmod":2924,"_;":2925,"ure":2926,"tri":2927,"Ġstringstream":2928,"1234567":2929,"âĸĢâĸĦ":2930,"lca":2931,"Ġboost":2932,"Ġ\"}\";":2933,"Ġfy":2934,"imum":2935,"Ġmove":2936,"stri":2937,")/(":2938,"ĠreadInt":2939,"Add":2940,"Ġdir":2941,"valid":2942,"tint":2943,"Ġ(~":2944,"100001":2945,"SERT":2946,"ircle":2947,"Ġstrchr":2948,"Ġshort":2949,"IMP":2950,"Ġ{};":2951,"Ġins":2952,"tests":2953,"Ġmm":2954,"ACE":2955,"Ġbad":2956,"Ġback":2957,"ĠFraction":2958,"Ġ;}":2959,"Ġpowmod":2960,"âĸĵâĸĵ":2961,"PT":2962,"Pro":2963,"Th":2964,"``":2965,"ucl":2966,"Ġmatrix":2967,"##~~":2968,"Ġui":2969,"Ġscl":2970,"tain":2971,"Ġxxx":2972,"%%%%":2973,"ĠMA":2974,"nodes":2975,"âĢ":2976,"ref":2977,"ingle":2978,"Ġ'*":2979,"Ġref":2980,"AB":2981,"To":2982,"Ġve":2983,"distance":2984,"'},{'.":2985,"rng":2986,"Ġmodulus":2987,"ifstream":2988,"entr":2989,"ctz":2990,"mk":2991,"ya":2992,"Ġna":2993,"div":2994,"]<<'":2995,"lol":2996,"vii":2997,"Ġsl":2998,"unlocked":2999,"ĠDFS":3000,"]]--;":3001,"jti":3002,"WWK":3003,"WWKK":3004,"KKKKW":3005,"ĠInf":3006,"LR":3007,"move":3008,"Ġcap":3009,"Ġfprintf":3010,"##_":3011,"Ġkol":3012,"Ġlist":3013,"++]=":3014,"âĸĳâĸĳâĸĳâĸĳâĸĳ":3015,"]!='":3016,"ðŁĴ":3017,"cxx":3018,"nl":3019,"Ġcand":3020,"ðŁĴ©":3021,"='":3022,"Whitespace":3023,"uk":3024,"FUNCTION":3025,"ĠSolve":3026,"Inverse":3027,"Ùİ":3028,"dec":3029,";(":3030,"Ġte":3031,"Ġfd":3032,"''":3033,",...)":3034,"Ġjj":3035,"Helper":3036,"ID":3037,"gt":3038,"ĠAns":3039,"ĠST":3040,"Ġflow":3041,"nr":3042,"which":3043,"________________________________":3044,"la":3045,"pf":3046,"owel":3047,"200000":3048,"SU":3049,"]?":3050,"vc":3051,"ĉĉĉĉĉĠĠ":3052,"ĠLLONG":3053,"dot":3054,"ways":3055,"ãģ":3056,"Ġerase":3057,"<<\"[":3058,"gg":3059,"tic":3060,"erence":3061,"ÑĤ":3062,"++];":3063,"ef":3064,"ĠĠĉĉ":3065,"Ġkk":3066,"Ġpat":3067,"ĠSIZE":3068,"error":3069,"PC":3070,"Ġford":3071,"imag":3072,"pc":3073,"dsu":3074,"Ġforeach":3075,"-----":3076,"Ġbits":3077,"Ġxy":3078,"Data":3079,"Ġck":3080,"Ġ'#":3081,"228":3082,"uu":3083,"Ġover":3084,"=\"\";":3085,"ðŁĴ©ðŁĴ©":3086,"<_":3087,"DL":3088,"modular":3089,"ĠFORE":3090,"]*(":3091,"â£»":3092,"â£½":3093,";;;;;;":3094,"Ġthan":3095,"Ġimp":3096,"Ġ'\"":3097,">='":3098,"(++":3099,"ts":3100,"Ġdr":3101,"apsed":3102,"vertexs":3103,"UL":3104,"pdate":3105,"()));":3106,"Ġchr":3107,"Ġdiv":3108,"DFS":3109,"Ġrs":3110,"otate":3111,"multi":3112,"oraryNode":3113,"has":3114,"Ġblock":3115,"vers":3116,"<<\"-":3117,"Ġdistance":3118,"lp":3119,"Ġdot":3120,"))*":3121,",__":3122,"^(":3123,"defor":3124,"Ġcr":3125,"Ġdown":3126,"GGGGGGGGGGGGGGGG":3127,"cpy":3128,"deforces":3129,")<(":3130,"Ġchange":3131,"KKKKKKKKKKKKKKK":3132,"WWWWWWWWWWW":3133,"DDDDDDDDDDD":3134,"EEEK":3135,"ASSERT":3136,"Solve":3137,"Ġsplit":3138,"EMP":3139,"lft":3140,"Ġmii":3141,"Ġ10000000":3142,"];}":3143,"Ġnn":3144,"Ġ>,":3145,"Ġfreq":3146,"prefix":3147,"Ġwhat":3148,"Ġrc":3149,")-(":3150,"EN":3151,"Ġsa":3152,"cx":3153,"mint":3154,"Ġsmall":3155,">>;":3156,"prv":3157,"]]==":3158,"Ġstream":3159,"Ġ>;":3160,"Ġwin":3161,"eing":3162,"arge":3163,"à¦¾":3164,"ĠTRACE":3165,"ARY":3166,"angle":3167,"/************************************************":3168,"Ġcenter":3169,"Se":3170,"%(":3171,"cb":3172,"onth":3173,"Ġalloc":3174,"MAT":3175,"FL":3176,"nw":3177,"Ġfaltu":3178,"ey":3179,"sx":3180,"oup":3181,"<<\",":3182,"Left":3183,"nect":3184,"***":3185,"prod":3186,"IntegerRange":3187,"âķ¬âķ¬âķ¬âķ¬":3188,"Ġiiii":3189,"ROW":3190,"argv":3191,"98":3192,"siz":3193,"Ġpiii":3194,"Ġtests":3195,"ide":3196,"Ġ();":3197,"Ġls":3198,"Ġ(!(":3199,"ĠEX":3200,"Ġgrid":3201,"âĸĢâĸĢâĸĢâĸĢ":3202,"\"[":3203,"utation":3204,"maxx":3205,"ĠUN":3206,"****************************************":3207,"99999999":3208,"Ġrun":3209,"undef":3210,"Dist":3211,"PUT":3212,"Ġpli":3213,"Impossible":3214,"Ġask":3215,"ĠTime":3216,"hell":3217,"ffff":3218,"Ġmultiply":3219,"gc":3220,"Ġbeg":3221,"chk":3222,"tti":3223,"acti":3224,"Ġtail":3225,"alpha":3226,"ĠThe":3227,"ĠMonoid":3228,"Ġsieve":3229,"Ġwhich":3230,"ĠGCD":3231,"FT":3232,"Ġfori":3233,"Ġtrans":3234,"\"]":3235,"LD":3236,"seeing":3237,"TASK":3238,"eb":3239,"Ġdivi":3240,"nax":3241,"Ġcs":3242,"][(":3243,"Ġ2000000000":3244,"]]]]":3245,"plus":3246,"bal":3247,"change":3248,"EEEEEE":3249,"oose":3250,"**************/":3251,"cumulate":3252,"EEEEE":3253,"mit":3254,"inter":3255,"==(":3256,"=*":3257,"OME":3258,"505":3259,"ersect":3260,"400":3261,">'":3262,"nm":3263,"run":3264,"Ġlp":3265,"Ġfir":3266,"ĠRe":3267,"DEB":3268,"ner":3269,"lev":3270,"<'":3271,"Ġlol":3272,"Ġdor":3273,"MMM":3274,"256":3275,"boost":3276,"::.":3277,"kek":3278,"ĠSQR":3279,"=_":3280,"Ġbl":3281,"Ġï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½":3282,">(),":3283,"zi":3284,"fter":3285,"Hash":3286,"ofstream":3287,"Ġrandom":3288,"\"),":3289,"src":3290,"Ġlhs":3291,"Ġfloat":3292,":::::":3293,"('\\":3294,"Ar":3295,"sprime":3296,"ĠIt":3297,"5005":3298,"):(":3299,"DP":3300,"ru":3301,"','.','.','.','.','.','.','.','.":3302,"Read":3303,"VER":3304,"day":3305,"Ġcarry":3306,"getline":3307,"Len":3308,"eks":3309,"war":3310,"Ġprefix":3311,"Ġsiz":3312,"Ġus":3313,"rect":3314,"opt":3315,"ĠName":3316,"ĠisPrime":3317,"pause":3318,"45":3319,"stra":3320,">>>":3321,"(&":3322,"Id":3323,");++(":3324,"(')":3325,"One":3326,"[_":3327,"lt":3328,"win":3329,"Ġprv":3330,"system":3331,"ĠFi":3332,",,,,,,":3333,"ader":3334,"prot":3335,"invd":3336,"Ġchrono":3337,"CA":3338,"Segment":3339,"carry":3340,"fir":3341,"Ġones":3342,"RI":3343,"|(":3344,"Ñģ":3345,");--":3346,"Ġaux":3347,"])+":3348,"ĠFORD":3349,">()":3350,"ql":3351,"(((":3352,"bution":3353,"â£¿â£¿â£¿â£¿â£¿â£¿":3354,"/**************":3355,"EG":3356,"fabs":3357,"ger":3358,"xy":3359,"olower":3360,"1000005":3361,"center":3362,"ee":3363,"Ġ**************/":3364,"decltype":3365,"Ġ<<(":3366,"=='-')":3367,"found":3368,"wa":3369,"Ġlvl":3370,"ĉĉĉĉĉĉĉĉĉĉĉĉĉĉ":3371,"uffer":3372,"Ġ~(":3373,"ia":3374,"ign":3375,"//*":3376,"Ġtin":3377,"Ġfs":3378,"INES":3379,"######":3380,"MATH":3381,"yes":3382,"Ġ\"!":3383,"~~~~":3384,"ov":3385,"Ġ@":3386,"Ġwork":3387,"DEFINES":3388,"[__":3389,"eci":3390,"fn":3391,"the":3392,"Ġ\"#":3393,"off":3394,"(){}":3395,"00001":3396,"Ġcomb":3397,"@@@@@@@@@@@@@@@@":3398,"Ġ\"{\";":3399,"author":3400,"mult":3401,"haust":3402,"problem":3403,"sf":3404,"ĠBig":3405,"ueries":3406,"ould":3407,"take":3408,"Double":3409,"ceil":3410,"Ġpoints":3411,"bbbb":3412,"DK":3413,"Ġsha":3414,"ĠDP":3415,"hausted":3416,"(\"/":3417,"templ":3418,"...:.":3419,"WWWWWK":3420,"Ġwhere":3421,"Ġprecalc":3422,",,,,,,,":3423,"WWWKK":3424,"WWWKKK":3425,"Ġfactor":3426,"âĸĴâĸĴâĸĴâĸĴâĸĴâĸĴ":3427,"ORT":3428,"ĠIter":3429,"IntegerIterator":3430,"stribution":3431,"BS":3432,"__);":3433,"*=(":3434,"OO":3435,"Res":3436,"Ġdone":3437,"++;}":3438,"Ġsolution":3439,"na":3440,"Ġer":3441,"imize":3442,"1234":3443,"grid":3444,"seq":3445,"),_":3446,"ĠFast":3447,"(!(":3448,"protector":3449,"&-":3450,"FAST":3451,"cm":3452,"og":3453,"ended":3454,"Ġql":3455,"Ġinfo":3456,"ĠEnd":3457,"ecial":3458,"Ġ\"[\"":3459,"72":3460,"Rep":3461,"np":3462,"lete":3463,"Ġinp":3464,"Ġvalid":3465,"ĠHead":3466,"'},{'.','.','.','.','.','.','.','.','.":3467,"Ġfoo":3468,"alf":3469,"Ġkek":3470,"And":3471,"ale":3472,"wr":3473,"Ð½":3474,"akh":3475,"||(":3476,"vvi":3477,"Ġ18":3478,"ĠSt":3479,"riend":3480,"[--":3481,"çļ":3482,"lect":3483,"Ġ29":3484,"ĠRFOR":3485,"çļĦ":3486,")!=":3487,"snd":3488,"Ġsnd":3489,"IMPL":3490,"BC":3491,"fun":3492,"ĠmodMul":3493,"ress":3494,"SET":3495,"Ġfiles":3496,"Ġmonth":3497,"setf":3498,"age":3499,"::::::":3500,":::::::":3501,"Ġ----------------------------------------------":3502,"stk":3503,"org":3504,"iform":3505,"647":3506,"geeks":3507,"Ġ1000000009":3508,"distribution":3509,"plic":3510,"Ġshow":3511,"bigmod":3512,"Ġstate":3513,"âłĽ":3514,"(*(":3515,"90":3516,"Ġ25":3517,"Buffer":3518,"Ġpld":3519,"ĠAllah":3520,"â£¾":3521,"very":3522,"azu":3523,"2005":3524,"})":3525,"//}":3526,"==\"":3527,"Ġeprintf":3528,"\",\"<<":3529,"ĠEND":3530,"Ġgener":3531,"Ġceil":3532,"oin":3533,"Args":3534,":\\":3535,"beg":3536,"gen":3537,"ĠSH":3538,"65":3539,"FN":3540,"/__":3541,"Ġï¿½":3542,"Ġopen":3543,"Ġyes":3544,"Ġreal":3545,"ument":3546,"ĠFirst":3547,"ĠOUT":3548,"factor":3549,",,,,,,,,,,,,,,,,":3550,")?(":3551,"eq":3552,"Ġsim":3553,"35":3554,"Ġng":3555,"<<\"]":3556,"Ġmodnum":3557,"current":3558,"Ġ-->":3559,"Ġ{+":3560,"Ġwho":3561,"70":3562,"}});":3563,"ĠCode":3564,"Ġbinpow":3565,"':":3566,"EL":3567,"istringstream":3568,"Ġ++__":3569,"ĠCon":3570,"ions":3571,"memo":3572,"Ġaccumulate":3573,"score":3574,"Ġfunc":3575,"ĠGET":3576,"ĉĉĠĠĊ":3577,"âĸĦâĸĦâĸĦâĸĦ":3578,"DI":3579,"KEE":3580,"MS":3581,"ĠMatrix":3582,"codeforces":3583,"ukazu":3584,"Oper":3585,"iw":3586,"Ġbo":3587,"app":3588,"Ġdef":3589,"sic":3590,">{":3591,"Di":3592,"px":3593,"vp":3594,"1024":3595,"âłĺ":3596,"By":3597,"Ġlink":3598,"Ġbp":3599,"ĠĠĠĉĉĉ":3600,"ĠNIL":3601,"Ġnullptr":3602,"entroid":3603,"DEE":3604,"DEEE":3605,"FI":3606,"WKKKK":3607,"()]":3608,"ĠTargs":3609,"WWWWWWWWWWWW":3610,"âĸĦâĸĢ":3611,"93":3612,"rhs":3613,"CHAR":3614,"Ġ--------------------":3615,"tx":3616,"Init":3617,"ĠModInt":3618,"Ġvertexs":3619,"]});":3620,"mq":3621,"Ġ[](":3622,"enti":3623,"Ġty":3624,"Ġvvll":3625,")&&":3626,"jt":3627,"//~":3628,"Ġ#__":3629,"337":3630,"readType":3631,"âĸĪâĸĪâĸĪâĸĪâĸĪâĸĪâĸĪâĸĪ":3632,"300005":3633,"Ġnr":3634,"__(":3635,"Ġdia":3636,"TESTS":3637,")][":3638,"lit":3639,"Ġ|_|":3640,"Ġelapsed":3641,"##~~##~~":3642,"Ġ('":3643,"Ġvals":3644,"ĠGod":3645,"ĠreadChar":3646,"Ġarea":3647,"buffer":3648,"Right":3649,"TIME":3650,"Ġcp":3651,"Ġuni":3652,"â¢¸":3653,"FILENAME":3654,"1415926535897932384626433832795":3655,"62":3656,"mode":3657,"ple":3658,"Ġra":3659,"Ġ48":3660,"ĠVector":3661,"argc":3662,"delta":3663,"da":3664,"Ġgot":3665,"ĠSP":3666,"Ġatan":3667,"ĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉĉ":3668,":..":3669,";//":3670,"rank":3671,"Ġcurrent":3672,"zz":3673,"ĠØ":3674,"ĠNumber":3675,"ĠmodInverse":3676,"Ġbug":3677,"ÐĲ":3678,"fori":3679,"Ġsame":3680,"(\".":3681,"match":3682,"]=='.')":3683,"';}":3684,"Ġdq":3685,"8888888":3686,"Ġ1000000000000000000":3687,"counter":3688,"mas":3689,"Ġmaxx":3690,"hoge":3691,"\":\"":3692,"Al":3693,"Idx":3694,"cn":3695,"ml":3696,"Ġcn":3697,"Ġinverse":3698,"Ġ300":3699,"âķĲâķ¦":3700,"âķĲâķ©":3701,"who":3702,"ren":3703,">>>>":3704,"ĠIT":3705,"versed":3706,"Ġ62":3707,"âķĲâķĲ":3708,"Ġlocal":3709,"ins":3710,";};":3711,"AND":3712,"permutation":3713,"Ġlf":3714,"Ġfound":3715,"Ġmas":3716,"ĠFF":3717,"ĠPQ":3718,"Ġtri":3719,"147":3720,"Ej":3721,"Graph":3722,"aux":3723,"hod":3724,"Ġdsu":3725,"Ġ2000":3726,"Ġqq":3727,"997":3728,"ĠreadType":3729,"MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM":3730,";\\":3731,"Ġio":3732,"uffle":3733,",;;":3734,"Ġmsk":3735,"Ġni":3736,"(_)":3737,")<=":3738,"same":3739,"Ġsout":3740,"ĠNO":3741,"abc":3742,"limit":3743,"510":3744,"Num":3745,"ĠÃ":3746,"Ġtaken":3747,"ĠdPower":3748,"loor":3749,"2222":3750,"################################################################":3751,"Use":3752,"strlen":3753,"height":3754,"'];":3755,"got":3756,"hh":3757,"not":3758,"pat":3759,"tj":3760,"ĠTES":3761,"prim":3762,"])-":3763,"88888":3764,")//":3765,"Ġ<<=":3766,"arn":3767,"nom":3768,"Ġpri":3769,"ĠCLR":3770,"sqr":3771,"active":3772,"Ġcall":3773,"ĠROF":3774,"10000000":3775,"onenti":3776,"Ġ++_":3777,"Ġwr":3778,"ĠCom":3779,"888888":3780,"AM":3781,"UE":3782,"night":3783,"Ġam":3784,"Ġdim":3785,"modify":3786,"+=\"":3787,"ORARY":3788,"EMPORARY":3789,"Ġpil":3790,"'))":3791,"ys":3792,"Ġero":3793,"poss":3794,"Dice":3795,"Ð¸":3796,"ÑĢ":3797,"Ġgoa":3798,"IG":3799,"Of":3800,"PLL":3801,"taken":3802,"Ġ\"\"":3803,"resolution":3804,"visit":3805,"Contain":3806,"call":3807,"ei":3808,"Ġvpi":3809,"Ġts":3810,"EEEEEEE":3811,"segment":3812,"Ġremove":3813,")>=":3814,"288":3815,"WKKKKKKKK":3816,"vb":3817,"++);":3818,"WWKKK":3819,"EEEEEEEEEE":3820,"WWWWWWWWWW":3821,"DDDDDDDDDD":3822,"divi":3823,"KKKKKKKKKKKKKKKKKKKKKKKK":3824,"tfLGG":3825,"403":3826,"â¢Ģâ¢Ģ":3827,"serve":3828,"//*//*":3829,"Ġdiagn":3830,"IE":3831,"optim":3832,"ĠRep":3833,"Ġenable":3834,"ostic":3835,"Ġdiagnostic":3836,"cepted":3837,"++++++++":3838,"clr":3839,"conj":3840,"Ġrg":3841,"Ġ200000":3842,"ĠMS":3843,"ĠSet":3844,"ĠLine":3845,"Ġ100100":3846,"Ġcounter":3847,"Ġonly":3848,"200010":3849,"Last":3850,"Mode":3851,"lhs":3852,"Ġpresent":3853,"14159265359":3854,"subtree":3855,"Ġlimit":3856,"Ġmint":3857,"Ġday":3858,"idul":3859,"ĠprContain":3860,"area":3861,"Ġncr":3862,"(\"<<":3863,"Ġang":3864,"Index":3865,"Ġflush":3866,"suff":3867,"âķĲâķ¦âķĲâķ©":3868,"ca":3869,"Ġlld":3870,"Ġtransform":3871,"warukazu":3872,"'},{'.','.','.','.','.','.','.','.','.'},{'.','.','.','.','.','.','.','.','.":3873,"cu":3874,"Ġaaa":3875,"ĠTree":3876,"ithub":3877,"ERO":3878,"*)":3879,"CC":3880,"fto":3881,"Ġfflush":3882,"Ġ'-'":3883,"Ġstack":3884,"AH":3885,"ONLINE":3886,"ni":3887,"Ġempty":3888,"Ġdc":3889,")].":3890,"){}":3891,"elp":3892,"Ġord":3893,"ĠPRINT":3894,"âĸĪâĸĪâķĳ":3895,"Ġtable":3896,"ations":3897,"func":3898,"xs":3899,"Ġdud":3900,"Ġargument":3901,"MXN":3902,"Exp":3903,"Ġxs":3904,"+='":3905,"ĠCO":3906,"âł¹":3907,"483":3908,"CM":3909,"LOG":3910,"eap":3911,"Ġ14":3912,"ĠDEB":3913,"ĠREV":3914,"Ġ'?')":3915,"(~":3916,"Ġum":3917,"inverse":3918,"visors":3919,"Ġvvl":3920,"Ġsegment":3921,"ĠFILL":3922,"lz":3923,"py":3924,"sw":3925,"Ġexponent":3926,"14159265358979323846264338327950":3927,"PR":3928,"Sub":3929,"seen":3930,"Ġrge":3931,"#######":3932,"maining":3933,"Arrays":3934,"Ð»":3935,"rease":3936,";;;;;;;":3937,"Ġ100010":3938,"github":3939,"ĠCON":3940,"reate":3941,"Ġlint":3942,"Ġlnum":3943,"ers":3944,"let":3945,"))))":3946,"modint":3947,"ModInt":3948,"Ġ'('":3949,"Ġ1000005":3950,"BIT":3951,"]->":3952,"_.":3953,"Ġ\"\")":3954,"((*":3955,"ĠDBG":3956,"-');":3957,"Head":3958,"Ġeach":3959,"Ġwt":3960,"=%":3961,"]%=":3962,"Ġlet":3963,"Ġmll":3964,"<<__":3965,"ĠTs":3966,"alloc":3967,"Ġdbl":3968,"Single":3969,"Ġ&(":3970,"Maxn":3971,"################################################":3972,"ersection":3973,"versedIntegerRange":3974,"Arg":3975,"Equal":3976,"Find":3977,"imp":3978,"Ġ**":3979,"Ġsb":3980,"1828":3981,"Ġnumbers":3982,"Pair":3983,"copy":3984,"Ġlft":3985,"Ġba":3986,"Ġfriend":3987,"Ġini":3988,"ĠBU":3989,"Ġ40":3990,"solver":3991,"ATE":3992,"Ġvertex":3993,"over":3994,"sd":3995,"source":3996,"wh":3997,"Ġdecltype":3998,"shift":3999,"The":4000,"VAR":4001,"dr":4002,"nu":4003,"Ġpol":4004,"Ġva":4005,"ĠSORT":4006,"ele":4007,"tolower":4008,"ĠAdd":4009,"Ġscn":4010,"Ġ(#":4011,"ĠTH":4012,")).":4013,"Ġequal":4014,"Ġ\\|":4015,"â¢»":4016,"=='\\":4017,"othing":4018,"onentiation":4019,"'][":4020,"defined":4021,"Ġnod":4022,"Ġchoose":4023,"86":4024,"ÙĦ":4025,"Ġ64":4026,"Ġcopy":4027,"Ġreplace":4028,"888888888888888888888888":4029,"Col":4030,"Ġ...)":4031,"Ġcor":4032,"Ġsx":4033,"Ġti":4034,"ĠBASE":4035,"Path":4036,"Ġtimer":4037,"Ġ):":4038,"â£Ĩ":4039,"ĠPi":4040,"Ġtrie":4041,"Ġnever":4042,"Ġbuff":4043,"remove":4044,"writeChar":4045,"home":4046,"ĠInteger":4047,"â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿â£¿":4048,"[]=":4049,"norm":4050,"Ġay":4051,"1000000000":4052,";........":4053,"EDD":4054,"WEEEEEEEEEEEE":4055,"Ġnw":4056,"KKE":4057,"KKW":4058,"WWKKKKK":4059,"<<\")":4060,"load":4061,"WWWK":4062,"info":4063,"tfGGGDDDDDDDDDDDD":4064,"cut":4065,"ini":4066,"Ġ23":4067,"Ġ256":4068,"Ġge":4069,",`":4070,"code":4071,"tar":4072,"arp":4073,"Ġllong":4074,"....:":4075,"Ġ%.":4076,"ĉĉĉĉĉĊ":4077,"ĠFIN":4078,"minus":4079,"ally":4080,"field":4081,"Ġshould":4082,"âĶĢâĶĢâĶĢâĶĢ":4083,"GL":4084,"bi":4085,"fp":4086,"svalc":4087,"ĠDe":4088,"Ġrepd":4089,"203":4090,"aaaa":4091,"rightChild":4092,"Ġsolver":4093,".:.":4094,"78":4095,"TN":4096,"]^":4097,"fft":4098,"ose":4099,"Ġcum":4100,"llint":4101,"enw":4102,"Ġ*__":4103,"ĠSL":4104,"addEdge":4105,"Ġchkmax":4106,"5000":4107,"CD":4108,"way":4109,"Ġï¿½ï¿½":4110,"Ġmset":4111,"Ġpy":4112,"1000001":4113,"digits":4114,"Ġsystem":4115,"14159265358979323846264338327950288":4116,"Flow":4117,"ka":4118,"Ġist":4119,"Ġact":4120,"Ġns":4121,"------------------------":4122,"NNNN":4123,"200001":4124,"147483":4125,"Ġmodinv":4126,"36":4127,"fail":4128,"ved":4129,"ise":4130,"ĠII":4131,"Ġnumeric":4132,"leftChild":4133,"OU":4134,"Ġinter":4135,"InputIterator":4136,"Sh":4137,"Sz":4138,"bx":4139,"td":4140,"Ġany":4141,"!='":4142,"]);}":4143,"ents":4144,"ĠUpdate":4145,"Ġrtn":4146,"Ġcases":4147,"'));":4148,"IR":4149,"ja":4150,"reserve":4151,"ĠAl":4152,"ĠCH":4153,"Ġcols":4154,"Ġ....":4155,"Ġclear":4156,"Ġ(&":4157,"Ġ-(":4158,"__<<\":":4159,"ĠSegment":4160,"Ġlbnd":4161,"uclide":4162,"ĠField":4163,"qry":4164,"Ġisprime":4165,"forr":4166,"Ġfout":4167,"*****/":4168,"Ġuid":4169,"Ġubnd":4170,"42":4171,";)":4172,"]&":4173,